zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
/*! @name GFLTPO_C1 - Global Fault Polarity */
/*! @{ */

#define VFCCU_1_GFLTPO_C1_PS32_MASK              (0x1U)
#define VFCCU_1_GFLTPO_C1_PS32_SHIFT             (0U)
#define VFCCU_1_GFLTPO_C1_PS32_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS32(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS32_SHIFT)) & VFCCU_1_GFLTPO_C1_PS32_MASK)

#define VFCCU_1_GFLTPO_C1_PS33_MASK              (0x2U)
#define VFCCU_1_GFLTPO_C1_PS33_SHIFT             (1U)
#define VFCCU_1_GFLTPO_C1_PS33_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS33(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS33_SHIFT)) & VFCCU_1_GFLTPO_C1_PS33_MASK)

#define VFCCU_1_GFLTPO_C1_PS34_MASK              (0x4U)
#define VFCCU_1_GFLTPO_C1_PS34_SHIFT             (2U)
#define VFCCU_1_GFLTPO_C1_PS34_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS34(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS34_SHIFT)) & VFCCU_1_GFLTPO_C1_PS34_MASK)

#define VFCCU_1_GFLTPO_C1_PS35_MASK              (0x8U)
#define VFCCU_1_GFLTPO_C1_PS35_SHIFT             (3U)
#define VFCCU_1_GFLTPO_C1_PS35_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS35(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS35_SHIFT)) & VFCCU_1_GFLTPO_C1_PS35_MASK)

#define VFCCU_1_GFLTPO_C1_PS36_MASK              (0x10U)
#define VFCCU_1_GFLTPO_C1_PS36_SHIFT             (4U)
#define VFCCU_1_GFLTPO_C1_PS36_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS36(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS36_SHIFT)) & VFCCU_1_GFLTPO_C1_PS36_MASK)

#define VFCCU_1_GFLTPO_C1_PS37_MASK              (0x20U)
#define VFCCU_1_GFLTPO_C1_PS37_SHIFT             (5U)
#define VFCCU_1_GFLTPO_C1_PS37_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS37(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS37_SHIFT)) & VFCCU_1_GFLTPO_C1_PS37_MASK)

#define VFCCU_1_GFLTPO_C1_PS38_MASK              (0x40U)
#define VFCCU_1_GFLTPO_C1_PS38_SHIFT             (6U)
#define VFCCU_1_GFLTPO_C1_PS38_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS38(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS38_SHIFT)) & VFCCU_1_GFLTPO_C1_PS38_MASK)

#define VFCCU_1_GFLTPO_C1_PS39_MASK              (0x80U)
#define VFCCU_1_GFLTPO_C1_PS39_SHIFT             (7U)
#define VFCCU_1_GFLTPO_C1_PS39_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS39(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS39_SHIFT)) & VFCCU_1_GFLTPO_C1_PS39_MASK)

#define VFCCU_1_GFLTPO_C1_PS40_MASK              (0x100U)
#define VFCCU_1_GFLTPO_C1_PS40_SHIFT             (8U)
#define VFCCU_1_GFLTPO_C1_PS40_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS40(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS40_SHIFT)) & VFCCU_1_GFLTPO_C1_PS40_MASK)

#define VFCCU_1_GFLTPO_C1_PS41_MASK              (0x200U)
#define VFCCU_1_GFLTPO_C1_PS41_SHIFT             (9U)
#define VFCCU_1_GFLTPO_C1_PS41_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS41(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS41_SHIFT)) & VFCCU_1_GFLTPO_C1_PS41_MASK)

#define VFCCU_1_GFLTPO_C1_PS42_MASK              (0x400U)
#define VFCCU_1_GFLTPO_C1_PS42_SHIFT             (10U)
#define VFCCU_1_GFLTPO_C1_PS42_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS42(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS42_SHIFT)) & VFCCU_1_GFLTPO_C1_PS42_MASK)

#define VFCCU_1_GFLTPO_C1_PS43_MASK              (0x800U)
#define VFCCU_1_GFLTPO_C1_PS43_SHIFT             (11U)
#define VFCCU_1_GFLTPO_C1_PS43_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS43(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS43_SHIFT)) & VFCCU_1_GFLTPO_C1_PS43_MASK)

#define VFCCU_1_GFLTPO_C1_PS44_MASK              (0x1000U)
#define VFCCU_1_GFLTPO_C1_PS44_SHIFT             (12U)
#define VFCCU_1_GFLTPO_C1_PS44_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS44(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS44_SHIFT)) & VFCCU_1_GFLTPO_C1_PS44_MASK)

#define VFCCU_1_GFLTPO_C1_PS45_MASK              (0x2000U)
#define VFCCU_1_GFLTPO_C1_PS45_SHIFT             (13U)
#define VFCCU_1_GFLTPO_C1_PS45_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS45(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS45_SHIFT)) & VFCCU_1_GFLTPO_C1_PS45_MASK)

#define VFCCU_1_GFLTPO_C1_PS46_MASK              (0x4000U)
#define VFCCU_1_GFLTPO_C1_PS46_SHIFT             (14U)
#define VFCCU_1_GFLTPO_C1_PS46_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS46(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS46_SHIFT)) & VFCCU_1_GFLTPO_C1_PS46_MASK)

#define VFCCU_1_GFLTPO_C1_PS47_MASK              (0x8000U)
#define VFCCU_1_GFLTPO_C1_PS47_SHIFT             (15U)
#define VFCCU_1_GFLTPO_C1_PS47_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS47(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS47_SHIFT)) & VFCCU_1_GFLTPO_C1_PS47_MASK)

#define VFCCU_1_GFLTPO_C1_PS48_MASK              (0x10000U)
#define VFCCU_1_GFLTPO_C1_PS48_SHIFT             (16U)
#define VFCCU_1_GFLTPO_C1_PS48_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS48(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS48_SHIFT)) & VFCCU_1_GFLTPO_C1_PS48_MASK)

#define VFCCU_1_GFLTPO_C1_PS49_MASK              (0x20000U)
#define VFCCU_1_GFLTPO_C1_PS49_SHIFT             (17U)
#define VFCCU_1_GFLTPO_C1_PS49_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS49(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS49_SHIFT)) & VFCCU_1_GFLTPO_C1_PS49_MASK)

#define VFCCU_1_GFLTPO_C1_PS50_MASK              (0x40000U)
#define VFCCU_1_GFLTPO_C1_PS50_SHIFT             (18U)
#define VFCCU_1_GFLTPO_C1_PS50_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS50(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS50_SHIFT)) & VFCCU_1_GFLTPO_C1_PS50_MASK)

#define VFCCU_1_GFLTPO_C1_PS51_MASK              (0x80000U)
#define VFCCU_1_GFLTPO_C1_PS51_SHIFT             (19U)
#define VFCCU_1_GFLTPO_C1_PS51_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS51(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS51_SHIFT)) & VFCCU_1_GFLTPO_C1_PS51_MASK)

#define VFCCU_1_GFLTPO_C1_PS52_MASK              (0x100000U)
#define VFCCU_1_GFLTPO_C1_PS52_SHIFT             (20U)
#define VFCCU_1_GFLTPO_C1_PS52_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS52(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS52_SHIFT)) & VFCCU_1_GFLTPO_C1_PS52_MASK)

#define VFCCU_1_GFLTPO_C1_PS53_MASK              (0x200000U)
#define VFCCU_1_GFLTPO_C1_PS53_SHIFT             (21U)
#define VFCCU_1_GFLTPO_C1_PS53_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS53(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS53_SHIFT)) & VFCCU_1_GFLTPO_C1_PS53_MASK)

#define VFCCU_1_GFLTPO_C1_PS54_MASK              (0x400000U)
#define VFCCU_1_GFLTPO_C1_PS54_SHIFT             (22U)
#define VFCCU_1_GFLTPO_C1_PS54_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS54(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS54_SHIFT)) & VFCCU_1_GFLTPO_C1_PS54_MASK)

#define VFCCU_1_GFLTPO_C1_PS55_MASK              (0x800000U)
#define VFCCU_1_GFLTPO_C1_PS55_SHIFT             (23U)
#define VFCCU_1_GFLTPO_C1_PS55_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS55(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS55_SHIFT)) & VFCCU_1_GFLTPO_C1_PS55_MASK)

#define VFCCU_1_GFLTPO_C1_PS56_MASK              (0x1000000U)
#define VFCCU_1_GFLTPO_C1_PS56_SHIFT             (24U)
#define VFCCU_1_GFLTPO_C1_PS56_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS56(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS56_SHIFT)) & VFCCU_1_GFLTPO_C1_PS56_MASK)

