zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTPO_C1_PS57_MASK              (0x2000000U)
#define VFCCU_1_GFLTPO_C1_PS57_SHIFT             (25U)
#define VFCCU_1_GFLTPO_C1_PS57_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS57(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS57_SHIFT)) & VFCCU_1_GFLTPO_C1_PS57_MASK)

#define VFCCU_1_GFLTPO_C1_PS58_MASK              (0x4000000U)
#define VFCCU_1_GFLTPO_C1_PS58_SHIFT             (26U)
#define VFCCU_1_GFLTPO_C1_PS58_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS58(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS58_SHIFT)) & VFCCU_1_GFLTPO_C1_PS58_MASK)

#define VFCCU_1_GFLTPO_C1_PS59_MASK              (0x8000000U)
#define VFCCU_1_GFLTPO_C1_PS59_SHIFT             (27U)
#define VFCCU_1_GFLTPO_C1_PS59_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS59(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS59_SHIFT)) & VFCCU_1_GFLTPO_C1_PS59_MASK)

#define VFCCU_1_GFLTPO_C1_PS60_MASK              (0x10000000U)
#define VFCCU_1_GFLTPO_C1_PS60_SHIFT             (28U)
#define VFCCU_1_GFLTPO_C1_PS60_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS60(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS60_SHIFT)) & VFCCU_1_GFLTPO_C1_PS60_MASK)

#define VFCCU_1_GFLTPO_C1_PS61_MASK              (0x20000000U)
#define VFCCU_1_GFLTPO_C1_PS61_SHIFT             (29U)
#define VFCCU_1_GFLTPO_C1_PS61_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS61(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS61_SHIFT)) & VFCCU_1_GFLTPO_C1_PS61_MASK)

#define VFCCU_1_GFLTPO_C1_PS62_MASK              (0x40000000U)
#define VFCCU_1_GFLTPO_C1_PS62_SHIFT             (30U)
#define VFCCU_1_GFLTPO_C1_PS62_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS62(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS62_SHIFT)) & VFCCU_1_GFLTPO_C1_PS62_MASK)

#define VFCCU_1_GFLTPO_C1_PS63_MASK              (0x80000000U)
#define VFCCU_1_GFLTPO_C1_PS63_SHIFT             (31U)
#define VFCCU_1_GFLTPO_C1_PS63_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C1_PS63(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C1_PS63_SHIFT)) & VFCCU_1_GFLTPO_C1_PS63_MASK)
/*! @} */

/*! @name GFLTPO_C2 - Global Fault Polarity */
/*! @{ */

#define VFCCU_1_GFLTPO_C2_PS64_MASK              (0x1U)
#define VFCCU_1_GFLTPO_C2_PS64_SHIFT             (0U)
#define VFCCU_1_GFLTPO_C2_PS64_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS64(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS64_SHIFT)) & VFCCU_1_GFLTPO_C2_PS64_MASK)

#define VFCCU_1_GFLTPO_C2_PS65_MASK              (0x2U)
#define VFCCU_1_GFLTPO_C2_PS65_SHIFT             (1U)
#define VFCCU_1_GFLTPO_C2_PS65_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS65(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS65_SHIFT)) & VFCCU_1_GFLTPO_C2_PS65_MASK)

#define VFCCU_1_GFLTPO_C2_PS66_MASK              (0x4U)
#define VFCCU_1_GFLTPO_C2_PS66_SHIFT             (2U)
#define VFCCU_1_GFLTPO_C2_PS66_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS66(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS66_SHIFT)) & VFCCU_1_GFLTPO_C2_PS66_MASK)

#define VFCCU_1_GFLTPO_C2_PS67_MASK              (0x8U)
#define VFCCU_1_GFLTPO_C2_PS67_SHIFT             (3U)
#define VFCCU_1_GFLTPO_C2_PS67_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS67(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS67_SHIFT)) & VFCCU_1_GFLTPO_C2_PS67_MASK)

#define VFCCU_1_GFLTPO_C2_PS68_MASK              (0x10U)
#define VFCCU_1_GFLTPO_C2_PS68_SHIFT             (4U)
#define VFCCU_1_GFLTPO_C2_PS68_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS68(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS68_SHIFT)) & VFCCU_1_GFLTPO_C2_PS68_MASK)

#define VFCCU_1_GFLTPO_C2_PS69_MASK              (0x20U)
#define VFCCU_1_GFLTPO_C2_PS69_SHIFT             (5U)
#define VFCCU_1_GFLTPO_C2_PS69_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS69(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS69_SHIFT)) & VFCCU_1_GFLTPO_C2_PS69_MASK)

#define VFCCU_1_GFLTPO_C2_PS70_MASK              (0x40U)
#define VFCCU_1_GFLTPO_C2_PS70_SHIFT             (6U)
#define VFCCU_1_GFLTPO_C2_PS70_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS70(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS70_SHIFT)) & VFCCU_1_GFLTPO_C2_PS70_MASK)

#define VFCCU_1_GFLTPO_C2_PS71_MASK              (0x80U)
#define VFCCU_1_GFLTPO_C2_PS71_SHIFT             (7U)
#define VFCCU_1_GFLTPO_C2_PS71_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS71(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS71_SHIFT)) & VFCCU_1_GFLTPO_C2_PS71_MASK)

#define VFCCU_1_GFLTPO_C2_PS72_MASK              (0x100U)
#define VFCCU_1_GFLTPO_C2_PS72_SHIFT             (8U)
#define VFCCU_1_GFLTPO_C2_PS72_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS72(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS72_SHIFT)) & VFCCU_1_GFLTPO_C2_PS72_MASK)

#define VFCCU_1_GFLTPO_C2_PS73_MASK              (0x200U)
#define VFCCU_1_GFLTPO_C2_PS73_SHIFT             (9U)
#define VFCCU_1_GFLTPO_C2_PS73_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS73(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS73_SHIFT)) & VFCCU_1_GFLTPO_C2_PS73_MASK)

#define VFCCU_1_GFLTPO_C2_PS74_MASK              (0x400U)
#define VFCCU_1_GFLTPO_C2_PS74_SHIFT             (10U)
#define VFCCU_1_GFLTPO_C2_PS74_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS74(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS74_SHIFT)) & VFCCU_1_GFLTPO_C2_PS74_MASK)

#define VFCCU_1_GFLTPO_C2_PS75_MASK              (0x800U)
#define VFCCU_1_GFLTPO_C2_PS75_SHIFT             (11U)
#define VFCCU_1_GFLTPO_C2_PS75_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS75(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS75_SHIFT)) & VFCCU_1_GFLTPO_C2_PS75_MASK)

#define VFCCU_1_GFLTPO_C2_PS76_MASK              (0x1000U)
#define VFCCU_1_GFLTPO_C2_PS76_SHIFT             (12U)
#define VFCCU_1_GFLTPO_C2_PS76_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS76(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS76_SHIFT)) & VFCCU_1_GFLTPO_C2_PS76_MASK)

#define VFCCU_1_GFLTPO_C2_PS77_MASK              (0x2000U)
#define VFCCU_1_GFLTPO_C2_PS77_SHIFT             (13U)
#define VFCCU_1_GFLTPO_C2_PS77_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS77(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS77_SHIFT)) & VFCCU_1_GFLTPO_C2_PS77_MASK)

#define VFCCU_1_GFLTPO_C2_PS78_MASK              (0x4000U)
#define VFCCU_1_GFLTPO_C2_PS78_SHIFT             (14U)
#define VFCCU_1_GFLTPO_C2_PS78_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS78(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS78_SHIFT)) & VFCCU_1_GFLTPO_C2_PS78_MASK)

#define VFCCU_1_GFLTPO_C2_PS79_MASK              (0x8000U)
#define VFCCU_1_GFLTPO_C2_PS79_SHIFT             (15U)
#define VFCCU_1_GFLTPO_C2_PS79_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS79(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS79_SHIFT)) & VFCCU_1_GFLTPO_C2_PS79_MASK)

#define VFCCU_1_GFLTPO_C2_PS80_MASK              (0x10000U)
#define VFCCU_1_GFLTPO_C2_PS80_SHIFT             (16U)
#define VFCCU_1_GFLTPO_C2_PS80_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS80(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS80_SHIFT)) & VFCCU_1_GFLTPO_C2_PS80_MASK)

#define VFCCU_1_GFLTPO_C2_PS81_MASK              (0x20000U)
#define VFCCU_1_GFLTPO_C2_PS81_SHIFT             (17U)
#define VFCCU_1_GFLTPO_C2_PS81_WIDTH             (1U)
#define VFCCU_1_GFLTPO_C2_PS81(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C2_PS81_SHIFT)) & VFCCU_1_GFLTPO_C2_PS81_MASK)

