zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTPO_C3_PS103_MASK             (0x80U)
#define VFCCU_1_GFLTPO_C3_PS103_SHIFT            (7U)
#define VFCCU_1_GFLTPO_C3_PS103_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS103(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS103_SHIFT)) & VFCCU_1_GFLTPO_C3_PS103_MASK)

#define VFCCU_1_GFLTPO_C3_PS104_MASK             (0x100U)
#define VFCCU_1_GFLTPO_C3_PS104_SHIFT            (8U)
#define VFCCU_1_GFLTPO_C3_PS104_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS104(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS104_SHIFT)) & VFCCU_1_GFLTPO_C3_PS104_MASK)

#define VFCCU_1_GFLTPO_C3_PS105_MASK             (0x200U)
#define VFCCU_1_GFLTPO_C3_PS105_SHIFT            (9U)
#define VFCCU_1_GFLTPO_C3_PS105_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS105(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS105_SHIFT)) & VFCCU_1_GFLTPO_C3_PS105_MASK)

#define VFCCU_1_GFLTPO_C3_PS106_MASK             (0x400U)
#define VFCCU_1_GFLTPO_C3_PS106_SHIFT            (10U)
#define VFCCU_1_GFLTPO_C3_PS106_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS106(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS106_SHIFT)) & VFCCU_1_GFLTPO_C3_PS106_MASK)

#define VFCCU_1_GFLTPO_C3_PS107_MASK             (0x800U)
#define VFCCU_1_GFLTPO_C3_PS107_SHIFT            (11U)
#define VFCCU_1_GFLTPO_C3_PS107_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS107(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS107_SHIFT)) & VFCCU_1_GFLTPO_C3_PS107_MASK)

#define VFCCU_1_GFLTPO_C3_PS108_MASK             (0x1000U)
#define VFCCU_1_GFLTPO_C3_PS108_SHIFT            (12U)
#define VFCCU_1_GFLTPO_C3_PS108_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS108(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS108_SHIFT)) & VFCCU_1_GFLTPO_C3_PS108_MASK)

#define VFCCU_1_GFLTPO_C3_PS109_MASK             (0x2000U)
#define VFCCU_1_GFLTPO_C3_PS109_SHIFT            (13U)
#define VFCCU_1_GFLTPO_C3_PS109_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS109(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS109_SHIFT)) & VFCCU_1_GFLTPO_C3_PS109_MASK)

#define VFCCU_1_GFLTPO_C3_PS110_MASK             (0x4000U)
#define VFCCU_1_GFLTPO_C3_PS110_SHIFT            (14U)
#define VFCCU_1_GFLTPO_C3_PS110_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS110(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS110_SHIFT)) & VFCCU_1_GFLTPO_C3_PS110_MASK)

#define VFCCU_1_GFLTPO_C3_PS111_MASK             (0x8000U)
#define VFCCU_1_GFLTPO_C3_PS111_SHIFT            (15U)
#define VFCCU_1_GFLTPO_C3_PS111_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS111(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS111_SHIFT)) & VFCCU_1_GFLTPO_C3_PS111_MASK)

#define VFCCU_1_GFLTPO_C3_PS112_MASK             (0x10000U)
#define VFCCU_1_GFLTPO_C3_PS112_SHIFT            (16U)
#define VFCCU_1_GFLTPO_C3_PS112_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS112(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS112_SHIFT)) & VFCCU_1_GFLTPO_C3_PS112_MASK)

#define VFCCU_1_GFLTPO_C3_PS113_MASK             (0x20000U)
#define VFCCU_1_GFLTPO_C3_PS113_SHIFT            (17U)
#define VFCCU_1_GFLTPO_C3_PS113_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS113(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS113_SHIFT)) & VFCCU_1_GFLTPO_C3_PS113_MASK)

#define VFCCU_1_GFLTPO_C3_PS114_MASK             (0x40000U)
#define VFCCU_1_GFLTPO_C3_PS114_SHIFT            (18U)
#define VFCCU_1_GFLTPO_C3_PS114_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS114(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS114_SHIFT)) & VFCCU_1_GFLTPO_C3_PS114_MASK)

#define VFCCU_1_GFLTPO_C3_PS115_MASK             (0x80000U)
#define VFCCU_1_GFLTPO_C3_PS115_SHIFT            (19U)
#define VFCCU_1_GFLTPO_C3_PS115_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS115(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS115_SHIFT)) & VFCCU_1_GFLTPO_C3_PS115_MASK)

#define VFCCU_1_GFLTPO_C3_PS116_MASK             (0x100000U)
#define VFCCU_1_GFLTPO_C3_PS116_SHIFT            (20U)
#define VFCCU_1_GFLTPO_C3_PS116_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS116(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS116_SHIFT)) & VFCCU_1_GFLTPO_C3_PS116_MASK)

#define VFCCU_1_GFLTPO_C3_PS117_MASK             (0x200000U)
#define VFCCU_1_GFLTPO_C3_PS117_SHIFT            (21U)
#define VFCCU_1_GFLTPO_C3_PS117_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS117(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS117_SHIFT)) & VFCCU_1_GFLTPO_C3_PS117_MASK)

#define VFCCU_1_GFLTPO_C3_PS118_MASK             (0x400000U)
#define VFCCU_1_GFLTPO_C3_PS118_SHIFT            (22U)
#define VFCCU_1_GFLTPO_C3_PS118_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS118(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS118_SHIFT)) & VFCCU_1_GFLTPO_C3_PS118_MASK)

#define VFCCU_1_GFLTPO_C3_PS119_MASK             (0x800000U)
#define VFCCU_1_GFLTPO_C3_PS119_SHIFT            (23U)
#define VFCCU_1_GFLTPO_C3_PS119_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS119(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS119_SHIFT)) & VFCCU_1_GFLTPO_C3_PS119_MASK)

#define VFCCU_1_GFLTPO_C3_PS120_MASK             (0x1000000U)
#define VFCCU_1_GFLTPO_C3_PS120_SHIFT            (24U)
#define VFCCU_1_GFLTPO_C3_PS120_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS120(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS120_SHIFT)) & VFCCU_1_GFLTPO_C3_PS120_MASK)

#define VFCCU_1_GFLTPO_C3_PS121_MASK             (0x2000000U)
#define VFCCU_1_GFLTPO_C3_PS121_SHIFT            (25U)
#define VFCCU_1_GFLTPO_C3_PS121_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS121(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS121_SHIFT)) & VFCCU_1_GFLTPO_C3_PS121_MASK)

#define VFCCU_1_GFLTPO_C3_PS122_MASK             (0x4000000U)
#define VFCCU_1_GFLTPO_C3_PS122_SHIFT            (26U)
#define VFCCU_1_GFLTPO_C3_PS122_WIDTH            (1U)
#define VFCCU_1_GFLTPO_C3_PS122(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTPO_C3_PS122_SHIFT)) & VFCCU_1_GFLTPO_C3_PS122_MASK)

