zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTRC_C1_RHWSW39_MASK           (0x80U)
#define VFCCU_1_GFLTRC_C1_RHWSW39_SHIFT          (7U)
#define VFCCU_1_GFLTRC_C1_RHWSW39_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW39(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW39_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW39_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW40_MASK           (0x100U)
#define VFCCU_1_GFLTRC_C1_RHWSW40_SHIFT          (8U)
#define VFCCU_1_GFLTRC_C1_RHWSW40_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW40(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW40_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW40_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW41_MASK           (0x200U)
#define VFCCU_1_GFLTRC_C1_RHWSW41_SHIFT          (9U)
#define VFCCU_1_GFLTRC_C1_RHWSW41_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW41(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW41_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW41_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW42_MASK           (0x400U)
#define VFCCU_1_GFLTRC_C1_RHWSW42_SHIFT          (10U)
#define VFCCU_1_GFLTRC_C1_RHWSW42_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW42(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW42_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW42_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW43_MASK           (0x800U)
#define VFCCU_1_GFLTRC_C1_RHWSW43_SHIFT          (11U)
#define VFCCU_1_GFLTRC_C1_RHWSW43_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW43(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW43_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW43_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW44_MASK           (0x1000U)
#define VFCCU_1_GFLTRC_C1_RHWSW44_SHIFT          (12U)
#define VFCCU_1_GFLTRC_C1_RHWSW44_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW44(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW44_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW44_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW45_MASK           (0x2000U)
#define VFCCU_1_GFLTRC_C1_RHWSW45_SHIFT          (13U)
#define VFCCU_1_GFLTRC_C1_RHWSW45_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW45(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW45_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW45_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW46_MASK           (0x4000U)
#define VFCCU_1_GFLTRC_C1_RHWSW46_SHIFT          (14U)
#define VFCCU_1_GFLTRC_C1_RHWSW46_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW46(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW46_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW46_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW47_MASK           (0x8000U)
#define VFCCU_1_GFLTRC_C1_RHWSW47_SHIFT          (15U)
#define VFCCU_1_GFLTRC_C1_RHWSW47_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW47(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW47_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW47_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW48_MASK           (0x10000U)
#define VFCCU_1_GFLTRC_C1_RHWSW48_SHIFT          (16U)
#define VFCCU_1_GFLTRC_C1_RHWSW48_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW48(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW48_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW48_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW49_MASK           (0x20000U)
#define VFCCU_1_GFLTRC_C1_RHWSW49_SHIFT          (17U)
#define VFCCU_1_GFLTRC_C1_RHWSW49_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW49(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW49_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW49_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW50_MASK           (0x40000U)
#define VFCCU_1_GFLTRC_C1_RHWSW50_SHIFT          (18U)
#define VFCCU_1_GFLTRC_C1_RHWSW50_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW50(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW50_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW50_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW51_MASK           (0x80000U)
#define VFCCU_1_GFLTRC_C1_RHWSW51_SHIFT          (19U)
#define VFCCU_1_GFLTRC_C1_RHWSW51_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW51(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW51_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW51_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW52_MASK           (0x100000U)
#define VFCCU_1_GFLTRC_C1_RHWSW52_SHIFT          (20U)
#define VFCCU_1_GFLTRC_C1_RHWSW52_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW52(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW52_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW52_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW53_MASK           (0x200000U)
#define VFCCU_1_GFLTRC_C1_RHWSW53_SHIFT          (21U)
#define VFCCU_1_GFLTRC_C1_RHWSW53_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW53(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW53_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW53_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW54_MASK           (0x400000U)
#define VFCCU_1_GFLTRC_C1_RHWSW54_SHIFT          (22U)
#define VFCCU_1_GFLTRC_C1_RHWSW54_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW54(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW54_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW54_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW55_MASK           (0x800000U)
#define VFCCU_1_GFLTRC_C1_RHWSW55_SHIFT          (23U)
#define VFCCU_1_GFLTRC_C1_RHWSW55_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW55(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW55_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW55_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW56_MASK           (0x1000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW56_SHIFT          (24U)
#define VFCCU_1_GFLTRC_C1_RHWSW56_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW56(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW56_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW56_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW57_MASK           (0x2000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW57_SHIFT          (25U)
#define VFCCU_1_GFLTRC_C1_RHWSW57_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW57(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW57_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW57_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW58_MASK           (0x4000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW58_SHIFT          (26U)
#define VFCCU_1_GFLTRC_C1_RHWSW58_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW58(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW58_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW58_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW59_MASK           (0x8000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW59_SHIFT          (27U)
#define VFCCU_1_GFLTRC_C1_RHWSW59_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW59(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW59_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW59_MASK)

