zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTRC_C1_RHWSW60_MASK           (0x10000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW60_SHIFT          (28U)
#define VFCCU_1_GFLTRC_C1_RHWSW60_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW60(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW60_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW60_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW61_MASK           (0x20000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW61_SHIFT          (29U)
#define VFCCU_1_GFLTRC_C1_RHWSW61_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW61(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW61_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW61_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW62_MASK           (0x40000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW62_SHIFT          (30U)
#define VFCCU_1_GFLTRC_C1_RHWSW62_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW62(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW62_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW62_MASK)

#define VFCCU_1_GFLTRC_C1_RHWSW63_MASK           (0x80000000U)
#define VFCCU_1_GFLTRC_C1_RHWSW63_SHIFT          (31U)
#define VFCCU_1_GFLTRC_C1_RHWSW63_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C1_RHWSW63(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C1_RHWSW63_SHIFT)) & VFCCU_1_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GFLTRC_C2 - Global Fault Recovery */
/*! @{ */

#define VFCCU_1_GFLTRC_C2_RHWSW64_MASK           (0x1U)
#define VFCCU_1_GFLTRC_C2_RHWSW64_SHIFT          (0U)
#define VFCCU_1_GFLTRC_C2_RHWSW64_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW64(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW64_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW64_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW65_MASK           (0x2U)
#define VFCCU_1_GFLTRC_C2_RHWSW65_SHIFT          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW65_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW65(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW65_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW65_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW66_MASK           (0x4U)
#define VFCCU_1_GFLTRC_C2_RHWSW66_SHIFT          (2U)
#define VFCCU_1_GFLTRC_C2_RHWSW66_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW66(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW66_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW66_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW67_MASK           (0x8U)
#define VFCCU_1_GFLTRC_C2_RHWSW67_SHIFT          (3U)
#define VFCCU_1_GFLTRC_C2_RHWSW67_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW67(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW67_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW67_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW68_MASK           (0x10U)
#define VFCCU_1_GFLTRC_C2_RHWSW68_SHIFT          (4U)
#define VFCCU_1_GFLTRC_C2_RHWSW68_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW68(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW68_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW68_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW69_MASK           (0x20U)
#define VFCCU_1_GFLTRC_C2_RHWSW69_SHIFT          (5U)
#define VFCCU_1_GFLTRC_C2_RHWSW69_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW69(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW69_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW69_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW70_MASK           (0x40U)
#define VFCCU_1_GFLTRC_C2_RHWSW70_SHIFT          (6U)
#define VFCCU_1_GFLTRC_C2_RHWSW70_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW70(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW70_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW70_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW71_MASK           (0x80U)
#define VFCCU_1_GFLTRC_C2_RHWSW71_SHIFT          (7U)
#define VFCCU_1_GFLTRC_C2_RHWSW71_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW71(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW71_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW71_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW72_MASK           (0x100U)
#define VFCCU_1_GFLTRC_C2_RHWSW72_SHIFT          (8U)
#define VFCCU_1_GFLTRC_C2_RHWSW72_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW72(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW72_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW72_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW73_MASK           (0x200U)
#define VFCCU_1_GFLTRC_C2_RHWSW73_SHIFT          (9U)
#define VFCCU_1_GFLTRC_C2_RHWSW73_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW73(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW73_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW73_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW74_MASK           (0x400U)
#define VFCCU_1_GFLTRC_C2_RHWSW74_SHIFT          (10U)
#define VFCCU_1_GFLTRC_C2_RHWSW74_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW74(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW74_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW74_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW75_MASK           (0x800U)
#define VFCCU_1_GFLTRC_C2_RHWSW75_SHIFT          (11U)
#define VFCCU_1_GFLTRC_C2_RHWSW75_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW75(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW75_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW75_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW76_MASK           (0x1000U)
#define VFCCU_1_GFLTRC_C2_RHWSW76_SHIFT          (12U)
#define VFCCU_1_GFLTRC_C2_RHWSW76_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW76(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW76_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW76_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW77_MASK           (0x2000U)
#define VFCCU_1_GFLTRC_C2_RHWSW77_SHIFT          (13U)
#define VFCCU_1_GFLTRC_C2_RHWSW77_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW77(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW77_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW77_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW78_MASK           (0x4000U)
#define VFCCU_1_GFLTRC_C2_RHWSW78_SHIFT          (14U)
#define VFCCU_1_GFLTRC_C2_RHWSW78_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW78(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW78_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW78_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW79_MASK           (0x8000U)
#define VFCCU_1_GFLTRC_C2_RHWSW79_SHIFT          (15U)
#define VFCCU_1_GFLTRC_C2_RHWSW79_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW79(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW79_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW79_MASK)

