zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTRC_C2_RHWSW80_MASK           (0x10000U)
#define VFCCU_1_GFLTRC_C2_RHWSW80_SHIFT          (16U)
#define VFCCU_1_GFLTRC_C2_RHWSW80_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW80(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW80_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW80_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW81_MASK           (0x20000U)
#define VFCCU_1_GFLTRC_C2_RHWSW81_SHIFT          (17U)
#define VFCCU_1_GFLTRC_C2_RHWSW81_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW81(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW81_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW81_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW82_MASK           (0x40000U)
#define VFCCU_1_GFLTRC_C2_RHWSW82_SHIFT          (18U)
#define VFCCU_1_GFLTRC_C2_RHWSW82_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW82(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW82_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW82_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW83_MASK           (0x80000U)
#define VFCCU_1_GFLTRC_C2_RHWSW83_SHIFT          (19U)
#define VFCCU_1_GFLTRC_C2_RHWSW83_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW83(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW83_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW83_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW84_MASK           (0x100000U)
#define VFCCU_1_GFLTRC_C2_RHWSW84_SHIFT          (20U)
#define VFCCU_1_GFLTRC_C2_RHWSW84_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW84(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW84_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW84_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW85_MASK           (0x200000U)
#define VFCCU_1_GFLTRC_C2_RHWSW85_SHIFT          (21U)
#define VFCCU_1_GFLTRC_C2_RHWSW85_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW85(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW85_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW85_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW86_MASK           (0x400000U)
#define VFCCU_1_GFLTRC_C2_RHWSW86_SHIFT          (22U)
#define VFCCU_1_GFLTRC_C2_RHWSW86_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW86(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW86_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW86_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW87_MASK           (0x800000U)
#define VFCCU_1_GFLTRC_C2_RHWSW87_SHIFT          (23U)
#define VFCCU_1_GFLTRC_C2_RHWSW87_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW87(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW87_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW87_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW88_MASK           (0x1000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW88_SHIFT          (24U)
#define VFCCU_1_GFLTRC_C2_RHWSW88_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW88(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW88_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW88_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW89_MASK           (0x2000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW89_SHIFT          (25U)
#define VFCCU_1_GFLTRC_C2_RHWSW89_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW89(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW89_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW89_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW90_MASK           (0x4000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW90_SHIFT          (26U)
#define VFCCU_1_GFLTRC_C2_RHWSW90_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW90(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW90_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW90_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW91_MASK           (0x8000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW91_SHIFT          (27U)
#define VFCCU_1_GFLTRC_C2_RHWSW91_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW91(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW91_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW91_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW92_MASK           (0x10000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW92_SHIFT          (28U)
#define VFCCU_1_GFLTRC_C2_RHWSW92_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW92(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW92_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW92_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW93_MASK           (0x20000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW93_SHIFT          (29U)
#define VFCCU_1_GFLTRC_C2_RHWSW93_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW93(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW93_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW93_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW94_MASK           (0x40000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW94_SHIFT          (30U)
#define VFCCU_1_GFLTRC_C2_RHWSW94_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW94(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW94_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW94_MASK)

#define VFCCU_1_GFLTRC_C2_RHWSW95_MASK           (0x80000000U)
#define VFCCU_1_GFLTRC_C2_RHWSW95_SHIFT          (31U)
#define VFCCU_1_GFLTRC_C2_RHWSW95_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C2_RHWSW95(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C2_RHWSW95_SHIFT)) & VFCCU_1_GFLTRC_C2_RHWSW95_MASK)
/*! @} */

/*! @name GFLTRC_C3 - Global Fault Recovery */
/*! @{ */

#define VFCCU_1_GFLTRC_C3_RHWSW96_MASK           (0x1U)
#define VFCCU_1_GFLTRC_C3_RHWSW96_SHIFT          (0U)
#define VFCCU_1_GFLTRC_C3_RHWSW96_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW96(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW96_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW96_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW97_MASK           (0x2U)
#define VFCCU_1_GFLTRC_C3_RHWSW97_SHIFT          (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW97_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW97(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW97_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW97_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW98_MASK           (0x4U)
#define VFCCU_1_GFLTRC_C3_RHWSW98_SHIFT          (2U)
#define VFCCU_1_GFLTRC_C3_RHWSW98_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW98(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW98_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW98_MASK)

