zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTRC_C3_RHWSW99_MASK           (0x8U)
#define VFCCU_1_GFLTRC_C3_RHWSW99_SHIFT          (3U)
#define VFCCU_1_GFLTRC_C3_RHWSW99_WIDTH          (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW99(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW99_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW99_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW100_MASK          (0x10U)
#define VFCCU_1_GFLTRC_C3_RHWSW100_SHIFT         (4U)
#define VFCCU_1_GFLTRC_C3_RHWSW100_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW100(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW100_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW100_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW101_MASK          (0x20U)
#define VFCCU_1_GFLTRC_C3_RHWSW101_SHIFT         (5U)
#define VFCCU_1_GFLTRC_C3_RHWSW101_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW101(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW101_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW101_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW102_MASK          (0x40U)
#define VFCCU_1_GFLTRC_C3_RHWSW102_SHIFT         (6U)
#define VFCCU_1_GFLTRC_C3_RHWSW102_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW102(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW102_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW102_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW103_MASK          (0x80U)
#define VFCCU_1_GFLTRC_C3_RHWSW103_SHIFT         (7U)
#define VFCCU_1_GFLTRC_C3_RHWSW103_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW103(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW103_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW103_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW104_MASK          (0x100U)
#define VFCCU_1_GFLTRC_C3_RHWSW104_SHIFT         (8U)
#define VFCCU_1_GFLTRC_C3_RHWSW104_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW104(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW104_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW104_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW105_MASK          (0x200U)
#define VFCCU_1_GFLTRC_C3_RHWSW105_SHIFT         (9U)
#define VFCCU_1_GFLTRC_C3_RHWSW105_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW105(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW105_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW105_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW106_MASK          (0x400U)
#define VFCCU_1_GFLTRC_C3_RHWSW106_SHIFT         (10U)
#define VFCCU_1_GFLTRC_C3_RHWSW106_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW106(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW106_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW106_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW107_MASK          (0x800U)
#define VFCCU_1_GFLTRC_C3_RHWSW107_SHIFT         (11U)
#define VFCCU_1_GFLTRC_C3_RHWSW107_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW107(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW107_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW107_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW108_MASK          (0x1000U)
#define VFCCU_1_GFLTRC_C3_RHWSW108_SHIFT         (12U)
#define VFCCU_1_GFLTRC_C3_RHWSW108_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW108(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW108_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW108_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW109_MASK          (0x2000U)
#define VFCCU_1_GFLTRC_C3_RHWSW109_SHIFT         (13U)
#define VFCCU_1_GFLTRC_C3_RHWSW109_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW109(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW109_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW109_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW110_MASK          (0x4000U)
#define VFCCU_1_GFLTRC_C3_RHWSW110_SHIFT         (14U)
#define VFCCU_1_GFLTRC_C3_RHWSW110_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW110(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW110_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW110_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW111_MASK          (0x8000U)
#define VFCCU_1_GFLTRC_C3_RHWSW111_SHIFT         (15U)
#define VFCCU_1_GFLTRC_C3_RHWSW111_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW111(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW111_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW111_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW112_MASK          (0x10000U)
#define VFCCU_1_GFLTRC_C3_RHWSW112_SHIFT         (16U)
#define VFCCU_1_GFLTRC_C3_RHWSW112_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW112(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW112_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW112_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW113_MASK          (0x20000U)
#define VFCCU_1_GFLTRC_C3_RHWSW113_SHIFT         (17U)
#define VFCCU_1_GFLTRC_C3_RHWSW113_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW113(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW113_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW113_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW114_MASK          (0x40000U)
#define VFCCU_1_GFLTRC_C3_RHWSW114_SHIFT         (18U)
#define VFCCU_1_GFLTRC_C3_RHWSW114_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW114(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW114_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW114_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW115_MASK          (0x80000U)
#define VFCCU_1_GFLTRC_C3_RHWSW115_SHIFT         (19U)
#define VFCCU_1_GFLTRC_C3_RHWSW115_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW115(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW115_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW115_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW116_MASK          (0x100000U)
#define VFCCU_1_GFLTRC_C3_RHWSW116_SHIFT         (20U)
#define VFCCU_1_GFLTRC_C3_RHWSW116_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW116(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW116_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW116_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW117_MASK          (0x200000U)
#define VFCCU_1_GFLTRC_C3_RHWSW117_SHIFT         (21U)
#define VFCCU_1_GFLTRC_C3_RHWSW117_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW117(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW117_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW117_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW118_MASK          (0x400000U)
#define VFCCU_1_GFLTRC_C3_RHWSW118_SHIFT         (22U)
#define VFCCU_1_GFLTRC_C3_RHWSW118_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW118(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW118_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW118_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW119_MASK          (0x800000U)
#define VFCCU_1_GFLTRC_C3_RHWSW119_SHIFT         (23U)
#define VFCCU_1_GFLTRC_C3_RHWSW119_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW119(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW119_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW119_MASK)

