zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_GFLTRC_C3_RHWSW120_MASK          (0x1000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW120_SHIFT         (24U)
#define VFCCU_1_GFLTRC_C3_RHWSW120_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW120(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW120_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW120_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW121_MASK          (0x2000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW121_SHIFT         (25U)
#define VFCCU_1_GFLTRC_C3_RHWSW121_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW121(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW121_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW121_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW122_MASK          (0x4000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW122_SHIFT         (26U)
#define VFCCU_1_GFLTRC_C3_RHWSW122_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW122(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW122_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW122_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW123_MASK          (0x8000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW123_SHIFT         (27U)
#define VFCCU_1_GFLTRC_C3_RHWSW123_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW123(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW123_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW123_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW124_MASK          (0x10000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW124_SHIFT         (28U)
#define VFCCU_1_GFLTRC_C3_RHWSW124_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW124(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW124_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW124_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW125_MASK          (0x20000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW125_SHIFT         (29U)
#define VFCCU_1_GFLTRC_C3_RHWSW125_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW125(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW125_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW125_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW126_MASK          (0x40000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW126_SHIFT         (30U)
#define VFCCU_1_GFLTRC_C3_RHWSW126_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW126(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW126_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW126_MASK)

#define VFCCU_1_GFLTRC_C3_RHWSW127_MASK          (0x80000000U)
#define VFCCU_1_GFLTRC_C3_RHWSW127_SHIFT         (31U)
#define VFCCU_1_GFLTRC_C3_RHWSW127_WIDTH         (1U)
#define VFCCU_1_GFLTRC_C3_RHWSW127(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GFLTRC_C3_RHWSW127_SHIFT)) & VFCCU_1_GFLTRC_C3_RHWSW127_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define VFCCU_1_GINTOVFS_FLTSERV_MASK            (0x80U)
#define VFCCU_1_GINTOVFS_FLTSERV_SHIFT           (7U)
#define VFCCU_1_GINTOVFS_FLTSERV_WIDTH           (1U)
#define VFCCU_1_GINTOVFS_FLTSERV(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GINTOVFS_FLTSERV_SHIFT)) & VFCCU_1_GINTOVFS_FLTSERV_MASK)

#define VFCCU_1_GINTOVFS_SERV_DID_MASK           (0xF0000U)
#define VFCCU_1_GINTOVFS_SERV_DID_SHIFT          (16U)
#define VFCCU_1_GINTOVFS_SERV_DID_WIDTH          (4U)
#define VFCCU_1_GINTOVFS_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GINTOVFS_SERV_DID_SHIFT)) & VFCCU_1_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GDBGCFG - Global Debug */
/*! @{ */

#define VFCCU_1_GDBGCFG_FRZ_MASK                 (0x10000U)
#define VFCCU_1_GDBGCFG_FRZ_SHIFT                (16U)
#define VFCCU_1_GDBGCFG_FRZ_WIDTH                (1U)
#define VFCCU_1_GDBGCFG_FRZ(x)                   (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GDBGCFG_FRZ_SHIFT)) & VFCCU_1_GDBGCFG_FRZ_MASK)
/*! @} */

/*! @name GDBGSTAT - Global Debug Status */
/*! @{ */

#define VFCCU_1_GDBGSTAT_FLTIND_MASK             (0xFFU)
#define VFCCU_1_GDBGSTAT_FLTIND_SHIFT            (0U)
#define VFCCU_1_GDBGSTAT_FLTIND_WIDTH            (8U)
#define VFCCU_1_GDBGSTAT_FLTIND(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GDBGSTAT_FLTIND_SHIFT)) & VFCCU_1_GDBGSTAT_FLTIND_MASK)

#define VFCCU_1_GDBGSTAT_RKN_ACK_MASK            (0x40000000U)
#define VFCCU_1_GDBGSTAT_RKN_ACK_SHIFT           (30U)
#define VFCCU_1_GDBGSTAT_RKN_ACK_WIDTH           (1U)
#define VFCCU_1_GDBGSTAT_RKN_ACK(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GDBGSTAT_RKN_ACK_SHIFT)) & VFCCU_1_GDBGSTAT_RKN_ACK_MASK)

#define VFCCU_1_GDBGSTAT_RKN_REQ_MASK            (0x80000000U)
#define VFCCU_1_GDBGSTAT_RKN_REQ_SHIFT           (31U)
#define VFCCU_1_GDBGSTAT_RKN_REQ_WIDTH           (1U)
#define VFCCU_1_GDBGSTAT_RKN_REQ(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_GDBGSTAT_RKN_REQ_SHIFT)) & VFCCU_1_GDBGSTAT_RKN_REQ_MASK)
/*! @} */

/*! @name FHCFG0 - Fault Handler */
/*! @{ */

#define VFCCU_1_FHCFG0_FHIDEN_MASK               (0x1U)
#define VFCCU_1_FHCFG0_FHIDEN_SHIFT              (0U)
#define VFCCU_1_FHCFG0_FHIDEN_WIDTH              (1U)
#define VFCCU_1_FHCFG0_FHIDEN(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHCFG0_FHIDEN_SHIFT)) & VFCCU_1_FHCFG0_FHIDEN_MASK)
/*! @} */

/*! @name FHSRVDS0 - Fault Handler Status */
/*! @{ */

#define VFCCU_1_FHSRVDS0_SERV_DID_MASK           (0xFU)
#define VFCCU_1_FHSRVDS0_SERV_DID_SHIFT          (0U)
#define VFCCU_1_FHSRVDS0_SERV_DID_WIDTH          (4U)
#define VFCCU_1_FHSRVDS0_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHSRVDS0_SERV_DID_SHIFT)) & VFCCU_1_FHSRVDS0_SERV_DID_MASK)

#define VFCCU_1_FHSRVDS0_AGGFLTS_MASK            (0x100U)
#define VFCCU_1_FHSRVDS0_AGGFLTS_SHIFT           (8U)
#define VFCCU_1_FHSRVDS0_AGGFLTS_WIDTH           (1U)
#define VFCCU_1_FHSRVDS0_AGGFLTS(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHSRVDS0_AGGFLTS_SHIFT)) & VFCCU_1_FHSRVDS0_AGGFLTS_MASK)
/*! @} */

/*! @name FHFLTENC0_0 - Fault Enable */
/*! @{ */

#define VFCCU_1_FHFLTENC0_0_EN0_MASK             (0x1U)
#define VFCCU_1_FHFLTENC0_0_EN0_SHIFT            (0U)
#define VFCCU_1_FHFLTENC0_0_EN0_WIDTH            (1U)
#define VFCCU_1_FHFLTENC0_0_EN0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_0_EN0_SHIFT)) & VFCCU_1_FHFLTENC0_0_EN0_MASK)

#define VFCCU_1_FHFLTENC0_0_EN1_MASK             (0x2U)
#define VFCCU_1_FHFLTENC0_0_EN1_SHIFT            (1U)
#define VFCCU_1_FHFLTENC0_0_EN1_WIDTH            (1U)
#define VFCCU_1_FHFLTENC0_0_EN1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_0_EN1_SHIFT)) & VFCCU_1_FHFLTENC0_0_EN1_MASK)

