zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTENC0_1_EN43_MASK            (0x800U)
#define VFCCU_1_FHFLTENC0_1_EN43_SHIFT           (11U)
#define VFCCU_1_FHFLTENC0_1_EN43_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN43(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN43_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN43_MASK)

#define VFCCU_1_FHFLTENC0_1_EN44_MASK            (0x1000U)
#define VFCCU_1_FHFLTENC0_1_EN44_SHIFT           (12U)
#define VFCCU_1_FHFLTENC0_1_EN44_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN44(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN44_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN44_MASK)

#define VFCCU_1_FHFLTENC0_1_EN45_MASK            (0x2000U)
#define VFCCU_1_FHFLTENC0_1_EN45_SHIFT           (13U)
#define VFCCU_1_FHFLTENC0_1_EN45_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN45(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN45_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN45_MASK)

#define VFCCU_1_FHFLTENC0_1_EN46_MASK            (0x4000U)
#define VFCCU_1_FHFLTENC0_1_EN46_SHIFT           (14U)
#define VFCCU_1_FHFLTENC0_1_EN46_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN46(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN46_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN46_MASK)

#define VFCCU_1_FHFLTENC0_1_EN47_MASK            (0x8000U)
#define VFCCU_1_FHFLTENC0_1_EN47_SHIFT           (15U)
#define VFCCU_1_FHFLTENC0_1_EN47_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN47(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN47_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN47_MASK)

#define VFCCU_1_FHFLTENC0_1_EN48_MASK            (0x10000U)
#define VFCCU_1_FHFLTENC0_1_EN48_SHIFT           (16U)
#define VFCCU_1_FHFLTENC0_1_EN48_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN48(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN48_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN48_MASK)

#define VFCCU_1_FHFLTENC0_1_EN49_MASK            (0x20000U)
#define VFCCU_1_FHFLTENC0_1_EN49_SHIFT           (17U)
#define VFCCU_1_FHFLTENC0_1_EN49_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN49(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN49_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN49_MASK)

#define VFCCU_1_FHFLTENC0_1_EN50_MASK            (0x40000U)
#define VFCCU_1_FHFLTENC0_1_EN50_SHIFT           (18U)
#define VFCCU_1_FHFLTENC0_1_EN50_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN50(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN50_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN50_MASK)

#define VFCCU_1_FHFLTENC0_1_EN51_MASK            (0x80000U)
#define VFCCU_1_FHFLTENC0_1_EN51_SHIFT           (19U)
#define VFCCU_1_FHFLTENC0_1_EN51_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN51(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN51_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN51_MASK)

#define VFCCU_1_FHFLTENC0_1_EN52_MASK            (0x100000U)
#define VFCCU_1_FHFLTENC0_1_EN52_SHIFT           (20U)
#define VFCCU_1_FHFLTENC0_1_EN52_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN52(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN52_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN52_MASK)

#define VFCCU_1_FHFLTENC0_1_EN53_MASK            (0x200000U)
#define VFCCU_1_FHFLTENC0_1_EN53_SHIFT           (21U)
#define VFCCU_1_FHFLTENC0_1_EN53_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN53(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN53_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN53_MASK)

#define VFCCU_1_FHFLTENC0_1_EN54_MASK            (0x400000U)
#define VFCCU_1_FHFLTENC0_1_EN54_SHIFT           (22U)
#define VFCCU_1_FHFLTENC0_1_EN54_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN54(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN54_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN54_MASK)

#define VFCCU_1_FHFLTENC0_1_EN55_MASK            (0x800000U)
#define VFCCU_1_FHFLTENC0_1_EN55_SHIFT           (23U)
#define VFCCU_1_FHFLTENC0_1_EN55_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN55_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN55_MASK)

#define VFCCU_1_FHFLTENC0_1_EN56_MASK            (0x1000000U)
#define VFCCU_1_FHFLTENC0_1_EN56_SHIFT           (24U)
#define VFCCU_1_FHFLTENC0_1_EN56_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN56_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN56_MASK)

#define VFCCU_1_FHFLTENC0_1_EN57_MASK            (0x2000000U)
#define VFCCU_1_FHFLTENC0_1_EN57_SHIFT           (25U)
#define VFCCU_1_FHFLTENC0_1_EN57_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN57_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN57_MASK)

#define VFCCU_1_FHFLTENC0_1_EN58_MASK            (0x4000000U)
#define VFCCU_1_FHFLTENC0_1_EN58_SHIFT           (26U)
#define VFCCU_1_FHFLTENC0_1_EN58_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN58_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN58_MASK)

#define VFCCU_1_FHFLTENC0_1_EN59_MASK            (0x8000000U)
#define VFCCU_1_FHFLTENC0_1_EN59_SHIFT           (27U)
#define VFCCU_1_FHFLTENC0_1_EN59_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN59_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN59_MASK)

#define VFCCU_1_FHFLTENC0_1_EN60_MASK            (0x10000000U)
#define VFCCU_1_FHFLTENC0_1_EN60_SHIFT           (28U)
#define VFCCU_1_FHFLTENC0_1_EN60_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN60_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN60_MASK)

#define VFCCU_1_FHFLTENC0_1_EN61_MASK            (0x20000000U)
#define VFCCU_1_FHFLTENC0_1_EN61_SHIFT           (29U)
#define VFCCU_1_FHFLTENC0_1_EN61_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN61_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN61_MASK)

#define VFCCU_1_FHFLTENC0_1_EN62_MASK            (0x40000000U)
#define VFCCU_1_FHFLTENC0_1_EN62_SHIFT           (30U)
#define VFCCU_1_FHFLTENC0_1_EN62_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_1_EN62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_1_EN62_SHIFT)) & VFCCU_1_FHFLTENC0_1_EN62_MASK)

