zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTENC0_2_EN84_MASK            (0x100000U)
#define VFCCU_1_FHFLTENC0_2_EN84_SHIFT           (20U)
#define VFCCU_1_FHFLTENC0_2_EN84_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN84(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN84_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN84_MASK)

#define VFCCU_1_FHFLTENC0_2_EN85_MASK            (0x200000U)
#define VFCCU_1_FHFLTENC0_2_EN85_SHIFT           (21U)
#define VFCCU_1_FHFLTENC0_2_EN85_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN85(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN85_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN85_MASK)

#define VFCCU_1_FHFLTENC0_2_EN86_MASK            (0x400000U)
#define VFCCU_1_FHFLTENC0_2_EN86_SHIFT           (22U)
#define VFCCU_1_FHFLTENC0_2_EN86_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN86(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN86_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN86_MASK)

#define VFCCU_1_FHFLTENC0_2_EN87_MASK            (0x800000U)
#define VFCCU_1_FHFLTENC0_2_EN87_SHIFT           (23U)
#define VFCCU_1_FHFLTENC0_2_EN87_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN87(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN87_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN87_MASK)

#define VFCCU_1_FHFLTENC0_2_EN88_MASK            (0x1000000U)
#define VFCCU_1_FHFLTENC0_2_EN88_SHIFT           (24U)
#define VFCCU_1_FHFLTENC0_2_EN88_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN88(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN88_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN88_MASK)

#define VFCCU_1_FHFLTENC0_2_EN89_MASK            (0x2000000U)
#define VFCCU_1_FHFLTENC0_2_EN89_SHIFT           (25U)
#define VFCCU_1_FHFLTENC0_2_EN89_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN89(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN89_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN89_MASK)

#define VFCCU_1_FHFLTENC0_2_EN90_MASK            (0x4000000U)
#define VFCCU_1_FHFLTENC0_2_EN90_SHIFT           (26U)
#define VFCCU_1_FHFLTENC0_2_EN90_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN90(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN90_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN90_MASK)

#define VFCCU_1_FHFLTENC0_2_EN91_MASK            (0x8000000U)
#define VFCCU_1_FHFLTENC0_2_EN91_SHIFT           (27U)
#define VFCCU_1_FHFLTENC0_2_EN91_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN91(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN91_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN91_MASK)

#define VFCCU_1_FHFLTENC0_2_EN92_MASK            (0x10000000U)
#define VFCCU_1_FHFLTENC0_2_EN92_SHIFT           (28U)
#define VFCCU_1_FHFLTENC0_2_EN92_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN92(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN92_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN92_MASK)

#define VFCCU_1_FHFLTENC0_2_EN93_MASK            (0x20000000U)
#define VFCCU_1_FHFLTENC0_2_EN93_SHIFT           (29U)
#define VFCCU_1_FHFLTENC0_2_EN93_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN93(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN93_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN93_MASK)

#define VFCCU_1_FHFLTENC0_2_EN94_MASK            (0x40000000U)
#define VFCCU_1_FHFLTENC0_2_EN94_SHIFT           (30U)
#define VFCCU_1_FHFLTENC0_2_EN94_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN94(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN94_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN94_MASK)

#define VFCCU_1_FHFLTENC0_2_EN95_MASK            (0x80000000U)
#define VFCCU_1_FHFLTENC0_2_EN95_SHIFT           (31U)
#define VFCCU_1_FHFLTENC0_2_EN95_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_2_EN95(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_2_EN95_SHIFT)) & VFCCU_1_FHFLTENC0_2_EN95_MASK)
/*! @} */

/*! @name FHFLTENC0_3 - Fault Enable */
/*! @{ */

#define VFCCU_1_FHFLTENC0_3_EN96_MASK            (0x1U)
#define VFCCU_1_FHFLTENC0_3_EN96_SHIFT           (0U)
#define VFCCU_1_FHFLTENC0_3_EN96_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_3_EN96(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN96_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN96_MASK)

#define VFCCU_1_FHFLTENC0_3_EN97_MASK            (0x2U)
#define VFCCU_1_FHFLTENC0_3_EN97_SHIFT           (1U)
#define VFCCU_1_FHFLTENC0_3_EN97_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_3_EN97(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN97_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN97_MASK)

#define VFCCU_1_FHFLTENC0_3_EN98_MASK            (0x4U)
#define VFCCU_1_FHFLTENC0_3_EN98_SHIFT           (2U)
#define VFCCU_1_FHFLTENC0_3_EN98_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_3_EN98(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN98_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN98_MASK)

#define VFCCU_1_FHFLTENC0_3_EN99_MASK            (0x8U)
#define VFCCU_1_FHFLTENC0_3_EN99_SHIFT           (3U)
#define VFCCU_1_FHFLTENC0_3_EN99_WIDTH           (1U)
#define VFCCU_1_FHFLTENC0_3_EN99(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN99_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN99_MASK)

#define VFCCU_1_FHFLTENC0_3_EN100_MASK           (0x10U)
#define VFCCU_1_FHFLTENC0_3_EN100_SHIFT          (4U)
#define VFCCU_1_FHFLTENC0_3_EN100_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN100(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN100_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN100_MASK)

#define VFCCU_1_FHFLTENC0_3_EN101_MASK           (0x20U)
#define VFCCU_1_FHFLTENC0_3_EN101_SHIFT          (5U)
#define VFCCU_1_FHFLTENC0_3_EN101_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN101(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN101_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN101_MASK)

#define VFCCU_1_FHFLTENC0_3_EN102_MASK           (0x40U)
#define VFCCU_1_FHFLTENC0_3_EN102_SHIFT          (6U)
#define VFCCU_1_FHFLTENC0_3_EN102_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN102(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN102_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN102_MASK)

#define VFCCU_1_FHFLTENC0_3_EN103_MASK           (0x80U)
#define VFCCU_1_FHFLTENC0_3_EN103_SHIFT          (7U)
#define VFCCU_1_FHFLTENC0_3_EN103_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN103(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN103_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN103_MASK)

#define VFCCU_1_FHFLTENC0_3_EN104_MASK           (0x100U)
#define VFCCU_1_FHFLTENC0_3_EN104_SHIFT          (8U)
#define VFCCU_1_FHFLTENC0_3_EN104_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN104(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN104_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN104_MASK)

#define VFCCU_1_FHFLTENC0_3_EN105_MASK           (0x200U)
#define VFCCU_1_FHFLTENC0_3_EN105_SHIFT          (9U)
#define VFCCU_1_FHFLTENC0_3_EN105_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN105(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN105_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN105_MASK)

#define VFCCU_1_FHFLTENC0_3_EN106_MASK           (0x400U)
#define VFCCU_1_FHFLTENC0_3_EN106_SHIFT          (10U)
#define VFCCU_1_FHFLTENC0_3_EN106_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN106(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN106_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN106_MASK)

#define VFCCU_1_FHFLTENC0_3_EN107_MASK           (0x800U)
#define VFCCU_1_FHFLTENC0_3_EN107_SHIFT          (11U)
#define VFCCU_1_FHFLTENC0_3_EN107_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN107(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN107_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN107_MASK)

#define VFCCU_1_FHFLTENC0_3_EN108_MASK           (0x1000U)
#define VFCCU_1_FHFLTENC0_3_EN108_SHIFT          (12U)
#define VFCCU_1_FHFLTENC0_3_EN108_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN108(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN108_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN108_MASK)

#define VFCCU_1_FHFLTENC0_3_EN109_MASK           (0x2000U)
#define VFCCU_1_FHFLTENC0_3_EN109_SHIFT          (13U)
#define VFCCU_1_FHFLTENC0_3_EN109_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN109(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN109_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN109_MASK)

#define VFCCU_1_FHFLTENC0_3_EN110_MASK           (0x4000U)
#define VFCCU_1_FHFLTENC0_3_EN110_SHIFT          (14U)
#define VFCCU_1_FHFLTENC0_3_EN110_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN110(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN110_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN110_MASK)

#define VFCCU_1_FHFLTENC0_3_EN111_MASK           (0x8000U)
#define VFCCU_1_FHFLTENC0_3_EN111_SHIFT          (15U)
#define VFCCU_1_FHFLTENC0_3_EN111_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN111(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN111_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN111_MASK)

#define VFCCU_1_FHFLTENC0_3_EN112_MASK           (0x10000U)
#define VFCCU_1_FHFLTENC0_3_EN112_SHIFT          (16U)
#define VFCCU_1_FHFLTENC0_3_EN112_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN112(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN112_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN112_MASK)

#define VFCCU_1_FHFLTENC0_3_EN113_MASK           (0x20000U)
#define VFCCU_1_FHFLTENC0_3_EN113_SHIFT          (17U)
#define VFCCU_1_FHFLTENC0_3_EN113_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN113(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN113_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN113_MASK)

#define VFCCU_1_FHFLTENC0_3_EN114_MASK           (0x40000U)
#define VFCCU_1_FHFLTENC0_3_EN114_SHIFT          (18U)
#define VFCCU_1_FHFLTENC0_3_EN114_WIDTH          (1U)
#define VFCCU_1_FHFLTENC0_3_EN114(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTENC0_3_EN114_SHIFT)) & VFCCU_1_FHFLTENC0_3_EN114_MASK)

