zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTS0_1_STAT51_MASK            (0x80000U)
#define VFCCU_1_FHFLTS0_1_STAT51_SHIFT           (19U)
#define VFCCU_1_FHFLTS0_1_STAT51_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT51(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT51_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT51_MASK)

#define VFCCU_1_FHFLTS0_1_STAT52_MASK            (0x100000U)
#define VFCCU_1_FHFLTS0_1_STAT52_SHIFT           (20U)
#define VFCCU_1_FHFLTS0_1_STAT52_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT52(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT52_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT52_MASK)

#define VFCCU_1_FHFLTS0_1_STAT53_MASK            (0x200000U)
#define VFCCU_1_FHFLTS0_1_STAT53_SHIFT           (21U)
#define VFCCU_1_FHFLTS0_1_STAT53_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT53(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT53_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT53_MASK)

#define VFCCU_1_FHFLTS0_1_STAT54_MASK            (0x400000U)
#define VFCCU_1_FHFLTS0_1_STAT54_SHIFT           (22U)
#define VFCCU_1_FHFLTS0_1_STAT54_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT54(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT54_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT54_MASK)

#define VFCCU_1_FHFLTS0_1_STAT55_MASK            (0x800000U)
#define VFCCU_1_FHFLTS0_1_STAT55_SHIFT           (23U)
#define VFCCU_1_FHFLTS0_1_STAT55_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT55_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT55_MASK)

#define VFCCU_1_FHFLTS0_1_STAT56_MASK            (0x1000000U)
#define VFCCU_1_FHFLTS0_1_STAT56_SHIFT           (24U)
#define VFCCU_1_FHFLTS0_1_STAT56_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT56_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT56_MASK)

#define VFCCU_1_FHFLTS0_1_STAT57_MASK            (0x2000000U)
#define VFCCU_1_FHFLTS0_1_STAT57_SHIFT           (25U)
#define VFCCU_1_FHFLTS0_1_STAT57_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT57_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT57_MASK)

#define VFCCU_1_FHFLTS0_1_STAT58_MASK            (0x4000000U)
#define VFCCU_1_FHFLTS0_1_STAT58_SHIFT           (26U)
#define VFCCU_1_FHFLTS0_1_STAT58_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT58_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT58_MASK)

#define VFCCU_1_FHFLTS0_1_STAT59_MASK            (0x8000000U)
#define VFCCU_1_FHFLTS0_1_STAT59_SHIFT           (27U)
#define VFCCU_1_FHFLTS0_1_STAT59_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT59_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT59_MASK)

#define VFCCU_1_FHFLTS0_1_STAT60_MASK            (0x10000000U)
#define VFCCU_1_FHFLTS0_1_STAT60_SHIFT           (28U)
#define VFCCU_1_FHFLTS0_1_STAT60_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT60_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT60_MASK)

#define VFCCU_1_FHFLTS0_1_STAT61_MASK            (0x20000000U)
#define VFCCU_1_FHFLTS0_1_STAT61_SHIFT           (29U)
#define VFCCU_1_FHFLTS0_1_STAT61_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT61_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT61_MASK)

#define VFCCU_1_FHFLTS0_1_STAT62_MASK            (0x40000000U)
#define VFCCU_1_FHFLTS0_1_STAT62_SHIFT           (30U)
#define VFCCU_1_FHFLTS0_1_STAT62_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT62_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT62_MASK)

#define VFCCU_1_FHFLTS0_1_STAT63_MASK            (0x80000000U)
#define VFCCU_1_FHFLTS0_1_STAT63_SHIFT           (31U)
#define VFCCU_1_FHFLTS0_1_STAT63_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_1_STAT63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_1_STAT63_SHIFT)) & VFCCU_1_FHFLTS0_1_STAT63_MASK)
/*! @} */

/*! @name FHFLTS0_2 - Fault Status */
/*! @{ */

#define VFCCU_1_FHFLTS0_2_STAT64_MASK            (0x1U)
#define VFCCU_1_FHFLTS0_2_STAT64_SHIFT           (0U)
#define VFCCU_1_FHFLTS0_2_STAT64_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT64(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT64_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT64_MASK)

#define VFCCU_1_FHFLTS0_2_STAT65_MASK            (0x2U)
#define VFCCU_1_FHFLTS0_2_STAT65_SHIFT           (1U)
#define VFCCU_1_FHFLTS0_2_STAT65_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT65(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT65_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT65_MASK)

#define VFCCU_1_FHFLTS0_2_STAT66_MASK            (0x4U)
#define VFCCU_1_FHFLTS0_2_STAT66_SHIFT           (2U)
#define VFCCU_1_FHFLTS0_2_STAT66_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT66(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT66_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT66_MASK)

#define VFCCU_1_FHFLTS0_2_STAT67_MASK            (0x8U)
#define VFCCU_1_FHFLTS0_2_STAT67_SHIFT           (3U)
#define VFCCU_1_FHFLTS0_2_STAT67_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT67(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT67_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT67_MASK)

#define VFCCU_1_FHFLTS0_2_STAT68_MASK            (0x10U)
#define VFCCU_1_FHFLTS0_2_STAT68_SHIFT           (4U)
#define VFCCU_1_FHFLTS0_2_STAT68_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT68(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT68_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT68_MASK)

#define VFCCU_1_FHFLTS0_2_STAT69_MASK            (0x20U)
#define VFCCU_1_FHFLTS0_2_STAT69_SHIFT           (5U)
#define VFCCU_1_FHFLTS0_2_STAT69_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT69(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT69_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT69_MASK)

#define VFCCU_1_FHFLTS0_2_STAT70_MASK            (0x40U)
#define VFCCU_1_FHFLTS0_2_STAT70_SHIFT           (6U)
#define VFCCU_1_FHFLTS0_2_STAT70_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT70(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT70_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT70_MASK)

