zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTS0_2_STAT95_MASK            (0x80000000U)
#define VFCCU_1_FHFLTS0_2_STAT95_SHIFT           (31U)
#define VFCCU_1_FHFLTS0_2_STAT95_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_2_STAT95(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_2_STAT95_SHIFT)) & VFCCU_1_FHFLTS0_2_STAT95_MASK)
/*! @} */

/*! @name FHFLTS0_3 - Fault Status */
/*! @{ */

#define VFCCU_1_FHFLTS0_3_STAT96_MASK            (0x1U)
#define VFCCU_1_FHFLTS0_3_STAT96_SHIFT           (0U)
#define VFCCU_1_FHFLTS0_3_STAT96_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_3_STAT96(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT96_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT96_MASK)

#define VFCCU_1_FHFLTS0_3_STAT97_MASK            (0x2U)
#define VFCCU_1_FHFLTS0_3_STAT97_SHIFT           (1U)
#define VFCCU_1_FHFLTS0_3_STAT97_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_3_STAT97(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT97_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT97_MASK)

#define VFCCU_1_FHFLTS0_3_STAT98_MASK            (0x4U)
#define VFCCU_1_FHFLTS0_3_STAT98_SHIFT           (2U)
#define VFCCU_1_FHFLTS0_3_STAT98_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_3_STAT98(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT98_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT98_MASK)

#define VFCCU_1_FHFLTS0_3_STAT99_MASK            (0x8U)
#define VFCCU_1_FHFLTS0_3_STAT99_SHIFT           (3U)
#define VFCCU_1_FHFLTS0_3_STAT99_WIDTH           (1U)
#define VFCCU_1_FHFLTS0_3_STAT99(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT99_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT99_MASK)

#define VFCCU_1_FHFLTS0_3_STAT100_MASK           (0x10U)
#define VFCCU_1_FHFLTS0_3_STAT100_SHIFT          (4U)
#define VFCCU_1_FHFLTS0_3_STAT100_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT100(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT100_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT100_MASK)

#define VFCCU_1_FHFLTS0_3_STAT101_MASK           (0x20U)
#define VFCCU_1_FHFLTS0_3_STAT101_SHIFT          (5U)
#define VFCCU_1_FHFLTS0_3_STAT101_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT101(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT101_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT101_MASK)

#define VFCCU_1_FHFLTS0_3_STAT102_MASK           (0x40U)
#define VFCCU_1_FHFLTS0_3_STAT102_SHIFT          (6U)
#define VFCCU_1_FHFLTS0_3_STAT102_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT102(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT102_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT102_MASK)

#define VFCCU_1_FHFLTS0_3_STAT103_MASK           (0x80U)
#define VFCCU_1_FHFLTS0_3_STAT103_SHIFT          (7U)
#define VFCCU_1_FHFLTS0_3_STAT103_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT103(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT103_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT103_MASK)

#define VFCCU_1_FHFLTS0_3_STAT104_MASK           (0x100U)
#define VFCCU_1_FHFLTS0_3_STAT104_SHIFT          (8U)
#define VFCCU_1_FHFLTS0_3_STAT104_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT104(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT104_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT104_MASK)

#define VFCCU_1_FHFLTS0_3_STAT105_MASK           (0x200U)
#define VFCCU_1_FHFLTS0_3_STAT105_SHIFT          (9U)
#define VFCCU_1_FHFLTS0_3_STAT105_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT105(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT105_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT105_MASK)

#define VFCCU_1_FHFLTS0_3_STAT106_MASK           (0x400U)
#define VFCCU_1_FHFLTS0_3_STAT106_SHIFT          (10U)
#define VFCCU_1_FHFLTS0_3_STAT106_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT106(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT106_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT106_MASK)

#define VFCCU_1_FHFLTS0_3_STAT107_MASK           (0x800U)
#define VFCCU_1_FHFLTS0_3_STAT107_SHIFT          (11U)
#define VFCCU_1_FHFLTS0_3_STAT107_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT107(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT107_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT107_MASK)

#define VFCCU_1_FHFLTS0_3_STAT108_MASK           (0x1000U)
#define VFCCU_1_FHFLTS0_3_STAT108_SHIFT          (12U)
#define VFCCU_1_FHFLTS0_3_STAT108_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT108(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT108_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT108_MASK)

#define VFCCU_1_FHFLTS0_3_STAT109_MASK           (0x2000U)
#define VFCCU_1_FHFLTS0_3_STAT109_SHIFT          (13U)
#define VFCCU_1_FHFLTS0_3_STAT109_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT109(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT109_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT109_MASK)

#define VFCCU_1_FHFLTS0_3_STAT110_MASK           (0x4000U)
#define VFCCU_1_FHFLTS0_3_STAT110_SHIFT          (14U)
#define VFCCU_1_FHFLTS0_3_STAT110_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT110(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT110_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT110_MASK)

#define VFCCU_1_FHFLTS0_3_STAT111_MASK           (0x8000U)
#define VFCCU_1_FHFLTS0_3_STAT111_SHIFT          (15U)
#define VFCCU_1_FHFLTS0_3_STAT111_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT111(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT111_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT111_MASK)

#define VFCCU_1_FHFLTS0_3_STAT112_MASK           (0x10000U)
#define VFCCU_1_FHFLTS0_3_STAT112_SHIFT          (16U)
#define VFCCU_1_FHFLTS0_3_STAT112_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT112(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT112_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT112_MASK)

#define VFCCU_1_FHFLTS0_3_STAT113_MASK           (0x20000U)
#define VFCCU_1_FHFLTS0_3_STAT113_SHIFT          (17U)
#define VFCCU_1_FHFLTS0_3_STAT113_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT113(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT113_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT113_MASK)

#define VFCCU_1_FHFLTS0_3_STAT114_MASK           (0x40000U)
#define VFCCU_1_FHFLTS0_3_STAT114_SHIFT          (18U)
#define VFCCU_1_FHFLTS0_3_STAT114_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT114(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT114_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT114_MASK)

