zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTS0_3_STAT115_MASK           (0x80000U)
#define VFCCU_1_FHFLTS0_3_STAT115_SHIFT          (19U)
#define VFCCU_1_FHFLTS0_3_STAT115_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT115(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT115_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT115_MASK)

#define VFCCU_1_FHFLTS0_3_STAT116_MASK           (0x100000U)
#define VFCCU_1_FHFLTS0_3_STAT116_SHIFT          (20U)
#define VFCCU_1_FHFLTS0_3_STAT116_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT116(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT116_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT116_MASK)

#define VFCCU_1_FHFLTS0_3_STAT117_MASK           (0x200000U)
#define VFCCU_1_FHFLTS0_3_STAT117_SHIFT          (21U)
#define VFCCU_1_FHFLTS0_3_STAT117_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT117(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT117_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT117_MASK)

#define VFCCU_1_FHFLTS0_3_STAT118_MASK           (0x400000U)
#define VFCCU_1_FHFLTS0_3_STAT118_SHIFT          (22U)
#define VFCCU_1_FHFLTS0_3_STAT118_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT118(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT118_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT118_MASK)

#define VFCCU_1_FHFLTS0_3_STAT119_MASK           (0x800000U)
#define VFCCU_1_FHFLTS0_3_STAT119_SHIFT          (23U)
#define VFCCU_1_FHFLTS0_3_STAT119_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT119(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT119_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT119_MASK)

#define VFCCU_1_FHFLTS0_3_STAT120_MASK           (0x1000000U)
#define VFCCU_1_FHFLTS0_3_STAT120_SHIFT          (24U)
#define VFCCU_1_FHFLTS0_3_STAT120_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT120(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT120_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT120_MASK)

#define VFCCU_1_FHFLTS0_3_STAT121_MASK           (0x2000000U)
#define VFCCU_1_FHFLTS0_3_STAT121_SHIFT          (25U)
#define VFCCU_1_FHFLTS0_3_STAT121_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT121(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT121_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT121_MASK)

#define VFCCU_1_FHFLTS0_3_STAT122_MASK           (0x4000000U)
#define VFCCU_1_FHFLTS0_3_STAT122_SHIFT          (26U)
#define VFCCU_1_FHFLTS0_3_STAT122_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT122(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT122_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT122_MASK)

#define VFCCU_1_FHFLTS0_3_STAT123_MASK           (0x8000000U)
#define VFCCU_1_FHFLTS0_3_STAT123_SHIFT          (27U)
#define VFCCU_1_FHFLTS0_3_STAT123_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT123(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT123_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT123_MASK)

#define VFCCU_1_FHFLTS0_3_STAT124_MASK           (0x10000000U)
#define VFCCU_1_FHFLTS0_3_STAT124_SHIFT          (28U)
#define VFCCU_1_FHFLTS0_3_STAT124_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT124(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT124_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT124_MASK)

#define VFCCU_1_FHFLTS0_3_STAT125_MASK           (0x20000000U)
#define VFCCU_1_FHFLTS0_3_STAT125_SHIFT          (29U)
#define VFCCU_1_FHFLTS0_3_STAT125_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT125(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT125_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT125_MASK)

#define VFCCU_1_FHFLTS0_3_STAT126_MASK           (0x40000000U)
#define VFCCU_1_FHFLTS0_3_STAT126_SHIFT          (30U)
#define VFCCU_1_FHFLTS0_3_STAT126_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT126(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT126_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT126_MASK)

#define VFCCU_1_FHFLTS0_3_STAT127_MASK           (0x80000000U)
#define VFCCU_1_FHFLTS0_3_STAT127_SHIFT          (31U)
#define VFCCU_1_FHFLTS0_3_STAT127_WIDTH          (1U)
#define VFCCU_1_FHFLTS0_3_STAT127(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTS0_3_STAT127_SHIFT)) & VFCCU_1_FHFLTS0_3_STAT127_MASK)
/*! @} */

/*! @name FHFLTRKC0_0 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_0_RKNSEL0_MASK         (0xFU)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL0_SHIFT        (0U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL0_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL0(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_0_RKNSEL0_SHIFT)) & VFCCU_1_FHFLTRKC0_0_RKNSEL0_MASK)

#define VFCCU_1_FHFLTRKC0_0_RKNSEL1_MASK         (0xF00U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL1_SHIFT        (8U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL1_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL1(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_0_RKNSEL1_SHIFT)) & VFCCU_1_FHFLTRKC0_0_RKNSEL1_MASK)

#define VFCCU_1_FHFLTRKC0_0_RKNSEL2_MASK         (0xF0000U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL2_SHIFT        (16U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL2_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL2(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_0_RKNSEL2_SHIFT)) & VFCCU_1_FHFLTRKC0_0_RKNSEL2_MASK)

#define VFCCU_1_FHFLTRKC0_0_RKNSEL3_MASK         (0xF000000U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL3_SHIFT        (24U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL3_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_0_RKNSEL3(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_0_RKNSEL3_SHIFT)) & VFCCU_1_FHFLTRKC0_0_RKNSEL3_MASK)
/*! @} */

/*! @name FHFLTRKC0_1 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_1_RKNSEL4_MASK         (0xFU)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL4_SHIFT        (0U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL4_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL4(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_1_RKNSEL4_SHIFT)) & VFCCU_1_FHFLTRKC0_1_RKNSEL4_MASK)

#define VFCCU_1_FHFLTRKC0_1_RKNSEL5_MASK         (0xF00U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL5_SHIFT        (8U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL5_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL5(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_1_RKNSEL5_SHIFT)) & VFCCU_1_FHFLTRKC0_1_RKNSEL5_MASK)

#define VFCCU_1_FHFLTRKC0_1_RKNSEL6_MASK         (0xF0000U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL6_SHIFT        (16U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL6_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL6(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_1_RKNSEL6_SHIFT)) & VFCCU_1_FHFLTRKC0_1_RKNSEL6_MASK)

#define VFCCU_1_FHFLTRKC0_1_RKNSEL7_MASK         (0xF000000U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL7_SHIFT        (24U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL7_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_1_RKNSEL7(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_1_RKNSEL7_SHIFT)) & VFCCU_1_FHFLTRKC0_1_RKNSEL7_MASK)
/*! @} */

/*! @name FHFLTRKC0_2 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_2_RKNSEL8_MASK         (0xFU)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL8_SHIFT        (0U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL8_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL8(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_2_RKNSEL8_SHIFT)) & VFCCU_1_FHFLTRKC0_2_RKNSEL8_MASK)

#define VFCCU_1_FHFLTRKC0_2_RKNSEL9_MASK         (0xF00U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL9_SHIFT        (8U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL9_WIDTH        (4U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL9(x)           (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_2_RKNSEL9_SHIFT)) & VFCCU_1_FHFLTRKC0_2_RKNSEL9_MASK)

#define VFCCU_1_FHFLTRKC0_2_RKNSEL10_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL10_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL10_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL10(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_2_RKNSEL10_SHIFT)) & VFCCU_1_FHFLTRKC0_2_RKNSEL10_MASK)

#define VFCCU_1_FHFLTRKC0_2_RKNSEL11_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL11_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL11_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_2_RKNSEL11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_2_RKNSEL11_SHIFT)) & VFCCU_1_FHFLTRKC0_2_RKNSEL11_MASK)
/*! @} */

/*! @name FHFLTRKC0_3 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_3_RKNSEL12_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL12_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL12_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_3_RKNSEL12_SHIFT)) & VFCCU_1_FHFLTRKC0_3_RKNSEL12_MASK)

