zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTRKC0_3_RKNSEL13_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL13_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL13_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_3_RKNSEL13_SHIFT)) & VFCCU_1_FHFLTRKC0_3_RKNSEL13_MASK)

#define VFCCU_1_FHFLTRKC0_3_RKNSEL14_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL14_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL14_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_3_RKNSEL14_SHIFT)) & VFCCU_1_FHFLTRKC0_3_RKNSEL14_MASK)

#define VFCCU_1_FHFLTRKC0_3_RKNSEL15_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL15_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL15_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_3_RKNSEL15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_3_RKNSEL15_SHIFT)) & VFCCU_1_FHFLTRKC0_3_RKNSEL15_MASK)
/*! @} */

/*! @name FHFLTRKC0_4 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_4_RKNSEL16_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL16_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL16_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL16(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_4_RKNSEL16_SHIFT)) & VFCCU_1_FHFLTRKC0_4_RKNSEL16_MASK)

#define VFCCU_1_FHFLTRKC0_4_RKNSEL17_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL17_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL17_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL17(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_4_RKNSEL17_SHIFT)) & VFCCU_1_FHFLTRKC0_4_RKNSEL17_MASK)

#define VFCCU_1_FHFLTRKC0_4_RKNSEL18_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL18_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL18_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL18(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_4_RKNSEL18_SHIFT)) & VFCCU_1_FHFLTRKC0_4_RKNSEL18_MASK)

#define VFCCU_1_FHFLTRKC0_4_RKNSEL19_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL19_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL19_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_4_RKNSEL19(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_4_RKNSEL19_SHIFT)) & VFCCU_1_FHFLTRKC0_4_RKNSEL19_MASK)
/*! @} */

/*! @name FHFLTRKC0_5 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_5_RKNSEL20_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL20_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL20_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL20(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_5_RKNSEL20_SHIFT)) & VFCCU_1_FHFLTRKC0_5_RKNSEL20_MASK)

#define VFCCU_1_FHFLTRKC0_5_RKNSEL21_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL21_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL21_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL21(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_5_RKNSEL21_SHIFT)) & VFCCU_1_FHFLTRKC0_5_RKNSEL21_MASK)

#define VFCCU_1_FHFLTRKC0_5_RKNSEL22_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL22_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL22_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL22(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_5_RKNSEL22_SHIFT)) & VFCCU_1_FHFLTRKC0_5_RKNSEL22_MASK)

#define VFCCU_1_FHFLTRKC0_5_RKNSEL23_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL23_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL23_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_5_RKNSEL23(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_5_RKNSEL23_SHIFT)) & VFCCU_1_FHFLTRKC0_5_RKNSEL23_MASK)
/*! @} */

/*! @name FHFLTRKC0_6 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_6_RKNSEL24_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL24_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL24_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL24(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_6_RKNSEL24_SHIFT)) & VFCCU_1_FHFLTRKC0_6_RKNSEL24_MASK)

#define VFCCU_1_FHFLTRKC0_6_RKNSEL25_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL25_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL25_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL25(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_6_RKNSEL25_SHIFT)) & VFCCU_1_FHFLTRKC0_6_RKNSEL25_MASK)

#define VFCCU_1_FHFLTRKC0_6_RKNSEL26_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL26_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL26_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL26(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_6_RKNSEL26_SHIFT)) & VFCCU_1_FHFLTRKC0_6_RKNSEL26_MASK)

#define VFCCU_1_FHFLTRKC0_6_RKNSEL27_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL27_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL27_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_6_RKNSEL27(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_6_RKNSEL27_SHIFT)) & VFCCU_1_FHFLTRKC0_6_RKNSEL27_MASK)
/*! @} */

/*! @name FHFLTRKC0_7 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_7_RKNSEL28_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL28_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL28_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL28(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_7_RKNSEL28_SHIFT)) & VFCCU_1_FHFLTRKC0_7_RKNSEL28_MASK)

#define VFCCU_1_FHFLTRKC0_7_RKNSEL29_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL29_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL29_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL29(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_7_RKNSEL29_SHIFT)) & VFCCU_1_FHFLTRKC0_7_RKNSEL29_MASK)

#define VFCCU_1_FHFLTRKC0_7_RKNSEL30_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL30_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL30_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL30(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_7_RKNSEL30_SHIFT)) & VFCCU_1_FHFLTRKC0_7_RKNSEL30_MASK)

#define VFCCU_1_FHFLTRKC0_7_RKNSEL31_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL31_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL31_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_7_RKNSEL31(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_7_RKNSEL31_SHIFT)) & VFCCU_1_FHFLTRKC0_7_RKNSEL31_MASK)
/*! @} */

/*! @name FHFLTRKC0_8 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_8_RKNSEL32_MASK        (0xFU)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL32_SHIFT       (0U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL32_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL32(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_8_RKNSEL32_SHIFT)) & VFCCU_1_FHFLTRKC0_8_RKNSEL32_MASK)

#define VFCCU_1_FHFLTRKC0_8_RKNSEL33_MASK        (0xF00U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL33_SHIFT       (8U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL33_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL33(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_8_RKNSEL33_SHIFT)) & VFCCU_1_FHFLTRKC0_8_RKNSEL33_MASK)

#define VFCCU_1_FHFLTRKC0_8_RKNSEL34_MASK        (0xF0000U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL34_SHIFT       (16U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL34_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL34(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_8_RKNSEL34_SHIFT)) & VFCCU_1_FHFLTRKC0_8_RKNSEL34_MASK)

#define VFCCU_1_FHFLTRKC0_8_RKNSEL35_MASK        (0xF000000U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL35_SHIFT       (24U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL35_WIDTH       (4U)
#define VFCCU_1_FHFLTRKC0_8_RKNSEL35(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_8_RKNSEL35_SHIFT)) & VFCCU_1_FHFLTRKC0_8_RKNSEL35_MASK)
/*! @} */

/*! @name FHFLTRKC0_9 - Fault Reaction Set Configuration */
/*! @{ */

