zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTRKC0_14_RKNSEL59_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_14_RKNSEL59_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_14_RKNSEL59_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_14_RKNSEL59(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_14_RKNSEL59_SHIFT)) & VFCCU_1_FHFLTRKC0_14_RKNSEL59_MASK)
/*! @} */

/*! @name FHFLTRKC0_15 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_15_RKNSEL60_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL60_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL60_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL60(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_15_RKNSEL60_SHIFT)) & VFCCU_1_FHFLTRKC0_15_RKNSEL60_MASK)

#define VFCCU_1_FHFLTRKC0_15_RKNSEL61_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL61_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL61_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL61(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_15_RKNSEL61_SHIFT)) & VFCCU_1_FHFLTRKC0_15_RKNSEL61_MASK)

#define VFCCU_1_FHFLTRKC0_15_RKNSEL62_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL62_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL62_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL62(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_15_RKNSEL62_SHIFT)) & VFCCU_1_FHFLTRKC0_15_RKNSEL62_MASK)

#define VFCCU_1_FHFLTRKC0_15_RKNSEL63_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL63_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL63_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_15_RKNSEL63(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_15_RKNSEL63_SHIFT)) & VFCCU_1_FHFLTRKC0_15_RKNSEL63_MASK)
/*! @} */

/*! @name FHFLTRKC0_16 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_16_RKNSEL64_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL64_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL64_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL64(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_16_RKNSEL64_SHIFT)) & VFCCU_1_FHFLTRKC0_16_RKNSEL64_MASK)

#define VFCCU_1_FHFLTRKC0_16_RKNSEL65_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL65_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL65_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL65(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_16_RKNSEL65_SHIFT)) & VFCCU_1_FHFLTRKC0_16_RKNSEL65_MASK)

#define VFCCU_1_FHFLTRKC0_16_RKNSEL66_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL66_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL66_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL66(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_16_RKNSEL66_SHIFT)) & VFCCU_1_FHFLTRKC0_16_RKNSEL66_MASK)

#define VFCCU_1_FHFLTRKC0_16_RKNSEL67_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL67_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL67_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_16_RKNSEL67(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_16_RKNSEL67_SHIFT)) & VFCCU_1_FHFLTRKC0_16_RKNSEL67_MASK)
/*! @} */

/*! @name FHFLTRKC0_17 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_17_RKNSEL68_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL68_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL68_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL68(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_17_RKNSEL68_SHIFT)) & VFCCU_1_FHFLTRKC0_17_RKNSEL68_MASK)

#define VFCCU_1_FHFLTRKC0_17_RKNSEL69_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL69_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL69_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL69(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_17_RKNSEL69_SHIFT)) & VFCCU_1_FHFLTRKC0_17_RKNSEL69_MASK)

#define VFCCU_1_FHFLTRKC0_17_RKNSEL70_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL70_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL70_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL70(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_17_RKNSEL70_SHIFT)) & VFCCU_1_FHFLTRKC0_17_RKNSEL70_MASK)

#define VFCCU_1_FHFLTRKC0_17_RKNSEL71_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL71_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL71_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_17_RKNSEL71(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_17_RKNSEL71_SHIFT)) & VFCCU_1_FHFLTRKC0_17_RKNSEL71_MASK)
/*! @} */

/*! @name FHFLTRKC0_18 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_18_RKNSEL72_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL72_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL72_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL72(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_18_RKNSEL72_SHIFT)) & VFCCU_1_FHFLTRKC0_18_RKNSEL72_MASK)

#define VFCCU_1_FHFLTRKC0_18_RKNSEL73_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL73_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL73_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL73(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_18_RKNSEL73_SHIFT)) & VFCCU_1_FHFLTRKC0_18_RKNSEL73_MASK)

#define VFCCU_1_FHFLTRKC0_18_RKNSEL74_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL74_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL74_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL74(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_18_RKNSEL74_SHIFT)) & VFCCU_1_FHFLTRKC0_18_RKNSEL74_MASK)

#define VFCCU_1_FHFLTRKC0_18_RKNSEL75_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL75_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL75_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_18_RKNSEL75(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_18_RKNSEL75_SHIFT)) & VFCCU_1_FHFLTRKC0_18_RKNSEL75_MASK)
/*! @} */

/*! @name FHFLTRKC0_19 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_19_RKNSEL76_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL76_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL76_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL76(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_19_RKNSEL76_SHIFT)) & VFCCU_1_FHFLTRKC0_19_RKNSEL76_MASK)

#define VFCCU_1_FHFLTRKC0_19_RKNSEL77_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL77_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL77_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL77(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_19_RKNSEL77_SHIFT)) & VFCCU_1_FHFLTRKC0_19_RKNSEL77_MASK)

