zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTRKC0_19_RKNSEL78_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL78_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL78_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL78(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_19_RKNSEL78_SHIFT)) & VFCCU_1_FHFLTRKC0_19_RKNSEL78_MASK)

#define VFCCU_1_FHFLTRKC0_19_RKNSEL79_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL79_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL79_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_19_RKNSEL79(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_19_RKNSEL79_SHIFT)) & VFCCU_1_FHFLTRKC0_19_RKNSEL79_MASK)
/*! @} */

/*! @name FHFLTRKC0_20 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_20_RKNSEL80_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL80_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL80_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL80(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_20_RKNSEL80_SHIFT)) & VFCCU_1_FHFLTRKC0_20_RKNSEL80_MASK)

#define VFCCU_1_FHFLTRKC0_20_RKNSEL81_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL81_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL81_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL81(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_20_RKNSEL81_SHIFT)) & VFCCU_1_FHFLTRKC0_20_RKNSEL81_MASK)

#define VFCCU_1_FHFLTRKC0_20_RKNSEL82_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL82_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL82_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL82(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_20_RKNSEL82_SHIFT)) & VFCCU_1_FHFLTRKC0_20_RKNSEL82_MASK)

#define VFCCU_1_FHFLTRKC0_20_RKNSEL83_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL83_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL83_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_20_RKNSEL83(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_20_RKNSEL83_SHIFT)) & VFCCU_1_FHFLTRKC0_20_RKNSEL83_MASK)
/*! @} */

/*! @name FHFLTRKC0_21 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_21_RKNSEL84_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL84_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL84_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL84(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_21_RKNSEL84_SHIFT)) & VFCCU_1_FHFLTRKC0_21_RKNSEL84_MASK)

#define VFCCU_1_FHFLTRKC0_21_RKNSEL85_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL85_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL85_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL85(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_21_RKNSEL85_SHIFT)) & VFCCU_1_FHFLTRKC0_21_RKNSEL85_MASK)

#define VFCCU_1_FHFLTRKC0_21_RKNSEL86_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL86_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL86_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL86(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_21_RKNSEL86_SHIFT)) & VFCCU_1_FHFLTRKC0_21_RKNSEL86_MASK)

#define VFCCU_1_FHFLTRKC0_21_RKNSEL87_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL87_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL87_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_21_RKNSEL87(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_21_RKNSEL87_SHIFT)) & VFCCU_1_FHFLTRKC0_21_RKNSEL87_MASK)
/*! @} */

/*! @name FHFLTRKC0_22 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_22_RKNSEL88_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL88_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL88_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL88(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_22_RKNSEL88_SHIFT)) & VFCCU_1_FHFLTRKC0_22_RKNSEL88_MASK)

#define VFCCU_1_FHFLTRKC0_22_RKNSEL89_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL89_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL89_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL89(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_22_RKNSEL89_SHIFT)) & VFCCU_1_FHFLTRKC0_22_RKNSEL89_MASK)

#define VFCCU_1_FHFLTRKC0_22_RKNSEL90_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL90_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL90_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL90(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_22_RKNSEL90_SHIFT)) & VFCCU_1_FHFLTRKC0_22_RKNSEL90_MASK)

#define VFCCU_1_FHFLTRKC0_22_RKNSEL91_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL91_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL91_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_22_RKNSEL91(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_22_RKNSEL91_SHIFT)) & VFCCU_1_FHFLTRKC0_22_RKNSEL91_MASK)
/*! @} */

/*! @name FHFLTRKC0_23 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_23_RKNSEL92_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL92_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL92_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL92(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_23_RKNSEL92_SHIFT)) & VFCCU_1_FHFLTRKC0_23_RKNSEL92_MASK)

#define VFCCU_1_FHFLTRKC0_23_RKNSEL93_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL93_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL93_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL93(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_23_RKNSEL93_SHIFT)) & VFCCU_1_FHFLTRKC0_23_RKNSEL93_MASK)

#define VFCCU_1_FHFLTRKC0_23_RKNSEL94_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL94_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL94_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL94(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_23_RKNSEL94_SHIFT)) & VFCCU_1_FHFLTRKC0_23_RKNSEL94_MASK)

#define VFCCU_1_FHFLTRKC0_23_RKNSEL95_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL95_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL95_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_23_RKNSEL95(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_23_RKNSEL95_SHIFT)) & VFCCU_1_FHFLTRKC0_23_RKNSEL95_MASK)
/*! @} */

/*! @name FHFLTRKC0_24 - Fault Reaction Set Configuration */
/*! @{ */

