zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTRKC0_24_RKNSEL96_MASK       (0xFU)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL96_SHIFT      (0U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL96_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL96(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_24_RKNSEL96_SHIFT)) & VFCCU_1_FHFLTRKC0_24_RKNSEL96_MASK)

#define VFCCU_1_FHFLTRKC0_24_RKNSEL97_MASK       (0xF00U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL97_SHIFT      (8U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL97_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL97(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_24_RKNSEL97_SHIFT)) & VFCCU_1_FHFLTRKC0_24_RKNSEL97_MASK)

#define VFCCU_1_FHFLTRKC0_24_RKNSEL98_MASK       (0xF0000U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL98_SHIFT      (16U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL98_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL98(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_24_RKNSEL98_SHIFT)) & VFCCU_1_FHFLTRKC0_24_RKNSEL98_MASK)

#define VFCCU_1_FHFLTRKC0_24_RKNSEL99_MASK       (0xF000000U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL99_SHIFT      (24U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL99_WIDTH      (4U)
#define VFCCU_1_FHFLTRKC0_24_RKNSEL99(x)         (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_24_RKNSEL99_SHIFT)) & VFCCU_1_FHFLTRKC0_24_RKNSEL99_MASK)
/*! @} */

/*! @name FHFLTRKC0_25 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_25_RKNSEL100_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL100_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL100_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL100(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_25_RKNSEL100_SHIFT)) & VFCCU_1_FHFLTRKC0_25_RKNSEL100_MASK)

#define VFCCU_1_FHFLTRKC0_25_RKNSEL101_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL101_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL101_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL101(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_25_RKNSEL101_SHIFT)) & VFCCU_1_FHFLTRKC0_25_RKNSEL101_MASK)

#define VFCCU_1_FHFLTRKC0_25_RKNSEL102_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL102_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL102_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL102(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_25_RKNSEL102_SHIFT)) & VFCCU_1_FHFLTRKC0_25_RKNSEL102_MASK)

#define VFCCU_1_FHFLTRKC0_25_RKNSEL103_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL103_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL103_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_25_RKNSEL103(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_25_RKNSEL103_SHIFT)) & VFCCU_1_FHFLTRKC0_25_RKNSEL103_MASK)
/*! @} */

/*! @name FHFLTRKC0_26 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_26_RKNSEL104_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL104_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL104_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL104(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_26_RKNSEL104_SHIFT)) & VFCCU_1_FHFLTRKC0_26_RKNSEL104_MASK)

#define VFCCU_1_FHFLTRKC0_26_RKNSEL105_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL105_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL105_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL105(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_26_RKNSEL105_SHIFT)) & VFCCU_1_FHFLTRKC0_26_RKNSEL105_MASK)

#define VFCCU_1_FHFLTRKC0_26_RKNSEL106_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL106_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL106_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL106(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_26_RKNSEL106_SHIFT)) & VFCCU_1_FHFLTRKC0_26_RKNSEL106_MASK)

#define VFCCU_1_FHFLTRKC0_26_RKNSEL107_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL107_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL107_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_26_RKNSEL107(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_26_RKNSEL107_SHIFT)) & VFCCU_1_FHFLTRKC0_26_RKNSEL107_MASK)
/*! @} */

/*! @name FHFLTRKC0_27 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_27_RKNSEL108_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL108_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL108_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL108(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_27_RKNSEL108_SHIFT)) & VFCCU_1_FHFLTRKC0_27_RKNSEL108_MASK)

#define VFCCU_1_FHFLTRKC0_27_RKNSEL109_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL109_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL109_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL109(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_27_RKNSEL109_SHIFT)) & VFCCU_1_FHFLTRKC0_27_RKNSEL109_MASK)

#define VFCCU_1_FHFLTRKC0_27_RKNSEL110_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL110_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL110_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL110(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_27_RKNSEL110_SHIFT)) & VFCCU_1_FHFLTRKC0_27_RKNSEL110_MASK)

#define VFCCU_1_FHFLTRKC0_27_RKNSEL111_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL111_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL111_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_27_RKNSEL111(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_27_RKNSEL111_SHIFT)) & VFCCU_1_FHFLTRKC0_27_RKNSEL111_MASK)
/*! @} */

/*! @name FHFLTRKC0_28 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_28_RKNSEL112_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL112_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL112_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL112(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_28_RKNSEL112_SHIFT)) & VFCCU_1_FHFLTRKC0_28_RKNSEL112_MASK)

#define VFCCU_1_FHFLTRKC0_28_RKNSEL113_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL113_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL113_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL113(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_28_RKNSEL113_SHIFT)) & VFCCU_1_FHFLTRKC0_28_RKNSEL113_MASK)

