zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_1.h
#define VFCCU_1_FHFLTRKC0_28_RKNSEL114_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL114_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL114_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL114(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_28_RKNSEL114_SHIFT)) & VFCCU_1_FHFLTRKC0_28_RKNSEL114_MASK)

#define VFCCU_1_FHFLTRKC0_28_RKNSEL115_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL115_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL115_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_28_RKNSEL115(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_28_RKNSEL115_SHIFT)) & VFCCU_1_FHFLTRKC0_28_RKNSEL115_MASK)
/*! @} */

/*! @name FHFLTRKC0_29 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_29_RKNSEL116_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL116_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL116_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL116(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_29_RKNSEL116_SHIFT)) & VFCCU_1_FHFLTRKC0_29_RKNSEL116_MASK)

#define VFCCU_1_FHFLTRKC0_29_RKNSEL117_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL117_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL117_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL117(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_29_RKNSEL117_SHIFT)) & VFCCU_1_FHFLTRKC0_29_RKNSEL117_MASK)

#define VFCCU_1_FHFLTRKC0_29_RKNSEL118_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL118_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL118_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL118(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_29_RKNSEL118_SHIFT)) & VFCCU_1_FHFLTRKC0_29_RKNSEL118_MASK)

#define VFCCU_1_FHFLTRKC0_29_RKNSEL119_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL119_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL119_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_29_RKNSEL119(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_29_RKNSEL119_SHIFT)) & VFCCU_1_FHFLTRKC0_29_RKNSEL119_MASK)
/*! @} */

/*! @name FHFLTRKC0_30 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_30_RKNSEL120_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL120_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL120_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL120(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_30_RKNSEL120_SHIFT)) & VFCCU_1_FHFLTRKC0_30_RKNSEL120_MASK)

#define VFCCU_1_FHFLTRKC0_30_RKNSEL121_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL121_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL121_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL121(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_30_RKNSEL121_SHIFT)) & VFCCU_1_FHFLTRKC0_30_RKNSEL121_MASK)

#define VFCCU_1_FHFLTRKC0_30_RKNSEL122_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL122_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL122_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL122(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_30_RKNSEL122_SHIFT)) & VFCCU_1_FHFLTRKC0_30_RKNSEL122_MASK)

#define VFCCU_1_FHFLTRKC0_30_RKNSEL123_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL123_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL123_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_30_RKNSEL123(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_30_RKNSEL123_SHIFT)) & VFCCU_1_FHFLTRKC0_30_RKNSEL123_MASK)
/*! @} */

/*! @name FHFLTRKC0_31 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_1_FHFLTRKC0_31_RKNSEL124_MASK      (0xFU)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL124_SHIFT     (0U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL124_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL124(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_31_RKNSEL124_SHIFT)) & VFCCU_1_FHFLTRKC0_31_RKNSEL124_MASK)

#define VFCCU_1_FHFLTRKC0_31_RKNSEL125_MASK      (0xF00U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL125_SHIFT     (8U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL125_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL125(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_31_RKNSEL125_SHIFT)) & VFCCU_1_FHFLTRKC0_31_RKNSEL125_MASK)

#define VFCCU_1_FHFLTRKC0_31_RKNSEL126_MASK      (0xF0000U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL126_SHIFT     (16U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL126_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL126(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_31_RKNSEL126_SHIFT)) & VFCCU_1_FHFLTRKC0_31_RKNSEL126_MASK)

#define VFCCU_1_FHFLTRKC0_31_RKNSEL127_MASK      (0xF000000U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL127_SHIFT     (24U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL127_WIDTH     (4U)
#define VFCCU_1_FHFLTRKC0_31_RKNSEL127(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHFLTRKC0_31_RKNSEL127_SHIFT)) & VFCCU_1_FHFLTRKC0_31_RKNSEL127_MASK)
/*! @} */

/*! @name FHIMRKC0_00 - Immediate Reaction Configuration */
/*! @{ */

#define VFCCU_1_FHIMRKC0_00_RKNEN0_MASK          (0x1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN0_SHIFT         (0U)
#define VFCCU_1_FHIMRKC0_00_RKNEN0_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN0(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN0_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN0_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN1_MASK          (0x2U)
#define VFCCU_1_FHIMRKC0_00_RKNEN1_SHIFT         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN1_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN1(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN1_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN1_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN2_MASK          (0x4U)
#define VFCCU_1_FHIMRKC0_00_RKNEN2_SHIFT         (2U)
#define VFCCU_1_FHIMRKC0_00_RKNEN2_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN2(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN2_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN2_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN3_MASK          (0x8U)
#define VFCCU_1_FHIMRKC0_00_RKNEN3_SHIFT         (3U)
#define VFCCU_1_FHIMRKC0_00_RKNEN3_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN3(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN3_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN3_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN4_MASK          (0x10U)
#define VFCCU_1_FHIMRKC0_00_RKNEN4_SHIFT         (4U)
#define VFCCU_1_FHIMRKC0_00_RKNEN4_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN4(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN4_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN4_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN5_MASK          (0x20U)
#define VFCCU_1_FHIMRKC0_00_RKNEN5_SHIFT         (5U)
#define VFCCU_1_FHIMRKC0_00_RKNEN5_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN5(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN5_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN5_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN6_MASK          (0x40U)
#define VFCCU_1_FHIMRKC0_00_RKNEN6_SHIFT         (6U)
#define VFCCU_1_FHIMRKC0_00_RKNEN6_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN6(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN6_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN6_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN7_MASK          (0x80U)
#define VFCCU_1_FHIMRKC0_00_RKNEN7_SHIFT         (7U)
#define VFCCU_1_FHIMRKC0_00_RKNEN7_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN7(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN7_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN7_MASK)

#define VFCCU_1_FHIMRKC0_00_RKNEN8_MASK          (0x100U)
#define VFCCU_1_FHIMRKC0_00_RKNEN8_SHIFT         (8U)
#define VFCCU_1_FHIMRKC0_00_RKNEN8_WIDTH         (1U)
#define VFCCU_1_FHIMRKC0_00_RKNEN8(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_1_FHIMRKC0_00_RKNEN8_SHIFT)) & VFCCU_1_FHIMRKC0_00_RKNEN8_MASK)

